{"status":"ok","feed":{"url":"https://medium.com/feed/@rgribeiro","title":"Stories by Rafael Ribeiro on Medium","link":"https://medium.com/@rgribeiro?source=rss-303f8669abf9------2","author":"","description":"Stories by Rafael Ribeiro on Medium","image":"https://cdn-images-1.medium.com/fit/c/150/150/1*kENQbV6PMDnIwa823jhf-Q.png"},"items":[{"title":"Concorrência em Go","pubDate":"2023-06-01 21:02:16","link":"https://medium.com/@rgribeiro/concorr%C3%AAncia-em-go-85b6a127b12f?source=rss-303f8669abf9------2","guid":"https://medium.com/p/85b6a127b12f","author":"Rafael Ribeiro","thumbnail":"https://cdn-images-1.medium.com/max/740/1*rxDdNJHiz1R38J_JEz23Zw.jpeg","description":"\n<h4>Como as goroutines e channels tornam o Go poderoso.</h4>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/740/1*rxDdNJHiz1R38J_JEz23Zw.jpeg\"></figure><p>Go é uma linguagem de programação desenvolvida no início dos anos 2000 pelos engenheiros da Google, Robert Griesemer, Rob Pike e Ken Thompson. O objetivo principal do desenvolvimento do Go era criar uma linguagem de programação moderna, eficiente e fácil de usar, adequada para o desenvolvimento de software escalável e de alto desempenho. O Go foi inspirado por linguagens como C, C ++, Java e C #. Ela mantém a sintaxe do C e, ao mesmo tempo, incorpora recursos de linguagens dinâmicas, como Python e Ruby.</p>\n<p>Uma das grandes vantagens do Go é o seu suporte nativo a concorrência e paralelismo. A concorrência é obtida através do conceito de Goroutines, que segundo a documentação oficial é “uma thread leve gerenciada pelo tempo de execução do Go”. Discutiremos com mais detalhes como isso pode ser feito.</p>\n<p>Além da Goroutines, temos as channels (“canais”) usados para a comunicação e sincronização entre goroutines. Os canais permitem que as goroutines troquem dados de maneira segura e coordenada, evitando condições de corrida e problemas de concorrência.</p>\n<p>Neste artigo, exploraremos dois dos principais pilares da concorrência no Go: as goroutines e os channels. As goroutines são responsáveis por permitir a execução assíncrona e leve de tarefas, enquanto os channels possibilitam a comunicação e a sincronização entre essas tarefas concorrentes.</p>\n<p>Descobriremos como as goroutines podem ser criadas e gerenciadas eficientemente, garantindo um aproveitamento máximo dos recursos do processador. Além disso, veremos como os channels facilitam a troca segura de dados entre as goroutines, evitando problemas comuns, como condições de corrida.</p>\n<h3>Goroutines: Execução leve e assíncrona</h3>\n<p>Antes de abordarmos o assunto principal deste artigo, é importante entendermos brevemente o que é concorrência e paralelismo, bem como as diferenças entre eles.</p>\n<ul>\n<li>\n<strong><em>Concorrência</em></strong><em> refere-se à execução aparentemente simultânea de múltiplas tarefas em um mesmo ambiente. Isso permite que diferentes partes de um programa sejam executadas em paralelo, compartilhando recursos e melhorando a eficiência do sistema.</em>\n</li>\n<li>\n<strong><em>Paralelismo </em></strong><em>envolve a execução real simultânea de tarefas em recursos de processamento distintos. Ao dividir uma tarefa em partes menores, chamadas de threads ou processos, essas partes podem ser executadas independentemente em paralelo, aproveitando ao máximo os recursos disponíveis.</em>\n</li>\n</ul>\n<p>Quando lidamos com tarefas concorrentes, a complexidade aumenta, pois estamos trabalhando com memória compartilhada, onde diferentes threads podem manipulá-la de maneiras imprevisíveis, resultando em erros não reproduzíveis e em resultados aleatórios, conhecidos como condições de corrida.</p>\n<p>A solução para esse problema reside em sincronizar as diferentes threads e bloquear os dados para que apenas uma thread possa modificá-los de cada vez. A linguagem Go possui recursos para bloqueio em sua biblioteca padrão, por meio do pacote “sync”, quando são necessários bloqueios em código de baixo nível. No entanto, experiências anteriores em engenharia de software mostraram que esse modelo leva a uma programação complexa e propensa a erros, além de diminuir o desempenho. Portanto, esse modelo clássico não é adequado para a programação moderna em multicore e multiprocessadores, onde o modelo “thread-per-connection” não é eficiente o suficiente.</p>\n<p>O Go adota um paradigma diferente, mais adequado para muitos casos, conhecido como Processos Sequenciais Comunicantes (CSP, inventado por C.A.R. Hoare) ou o modelo de passagem de mensagens, aplicado em outras linguagens, como Erlang.</p>\n<p>As partes de um aplicativo executadas são simultaneamente chamadas de goroutines em Go. Elas são essencialmente computações executadas em simultâneo. Não há uma correspondência direta entre uma goroutine e uma thread do sistema operacional: uma goroutine é mapeada para (ou multiplexada por) uma ou mais threads, conforme a disponibilidade. O escalonador de goroutines do Go cuida dessa execução.</p>\n<p>As goroutines são executadas no mesmo espaço de endereços, o que significa que o acesso à memória compartilhada deve ser sincronizado. Embora seja possível usar o pacote sync para sincronização, essa abordagem é altamente desencorajada. Em vez disso, o Go utiliza “channels” para sincronizar goroutines.</p>\n<p>Channels serão discutidos com mais detalhes na próxima seção.</p>\n<p>Dessa forma, no Go, as goroutines são a base da concorrência e do paralelismo. Elas permitem a execução de tarefas de forma assíncrona e leve, garantindo um alto grau de eficiência e escalabilidade. Nesta seção, exploraremos em detalhes o conceito e o funcionamento das goroutines.</p>\n<h4>O que são Goroutines</h4>\n<p>As goroutines são unidades de execução leves gerenciadas pelo runtime do Go. Ao contrário das threads tradicionais, elas são extremamente leves, permitindo a criação de centenas, milhares e até milhões delas em um único programa.</p>\n<p>As goroutines são executadas em um único thread chamado “máquina de execução de goroutines” (<em>goroutine scheduler</em>). Essa máquina de execução é responsável por escalonar e distribuir as goroutines nos núcleos de processamento disponíveis, garantindo uma execução eficiente e concorrente.</p>\n<p>Comparadas às threads tradicionais, as goroutines apresentam várias vantagens significativas. Por serem leves em termos de consumo de memória, as goroutines podem ser criadas em grande escala sem sobrecarregar o sistema. Além disso, o custo de criação e destruição de goroutines é muito baixo, permitindo uma abordagem mais flexível para a concorrência.</p>\n<p>Uma goroutine é implementada como uma função ou método (também pode ser uma função anônima ou lambda) e é chamada (invocada) com a palavra-chave “go”. Isso inicia a execução da função de forma concorrente com o cálculo atual, mas no mesmo espaço de endereço e com sua própria pilha. Por exemplo:</p>\n<pre>func main() {<br>    go minhaFuncao() // Criando uma goroutine<br>    // Restante do código principal<br>}<br>func minhaFuncao() {<br>    // Lógica da função<br>}<br></pre>\n<p>A pilha de uma goroutine é gerenciada de maneira eficiente, crescendo e diminuindo conforme o necessário. Não há possibilidade de estouro de pilha e o programador não precisa se preocupar com o tamanho da pilha. Quando a goroutine termina, ela sai silenciosamente, o que significa que nada é retornado para a função que a iniciou. A função main(), que todo programa Go deve ter, também pode ser vista como uma goroutine, embora não seja iniciada com go. As goroutines podem ser executadas durante a inicialização do programa (na função init()).</p>\n<p>Uma goroutine em execução pode interromper a si mesma chamando runtime.Goexit(), embora isso raramente seja necessário. Quando uma goroutine é muito intensiva em processamento, você pode chamar periodicamente runtime.Gosched() em seus loops de cálculo. Isso cede o processador, permitindo que outras goroutines sejam executadas. Isso não suspende a goroutine atual, então a execução é retomada automaticamente. Ao usar Gosched(), os cálculos são distribuídos de forma mais equilibrada e a comunicação não fica prejudicada.</p>\n<h3>Channels: Comunicação e sincronização entre goroutines</h3>\n<p>Para podermos tirar o máximo proveito das goroutines, é preciso que elas se comuniquem, já que as goroutines não se comunicam por padrão. Isso pode ser feito por meio do compartilhamento de variáveis, mas isso é extremamente complexo, já que essa forma de trabalhar apresenta todas as dificuldades com memória compartilhada em multithreading. Para isso, o <strong>Go</strong> introduz o que chamamos de <em>channel</em>, que seja canal (conduíte) que conecta canais concorrentes para ser possível enviar dados e lidar com a comunicação entre as goroutines, dessa forma evitamos os problemas da memória compartilhada. Já que o ato de comunicação mediante um canal garante a sincronização; não há necessidade de sincronização explícita por meio de bloqueio de nada.</p>\n<p>Os dados são transmitidos nos canais: <em>apenas uma goroutine tem acesso a um item de dados a qualquer momento: portanto, corridas de dados não podem ocorrer, por design</em>. A propriedade dos dados (ou seja, a capacidade de lê-los e escrevê-los) é repassada.</p>\n<p>A forma genérica de se declarar um canal em go é</p>\n<pre>var identifier chan datatype</pre>\n<p>Ao declarar um canal, seu valor inicial sera nil.</p>\n<p>Um canal só pode transmitir dados de apenas um tipo, por exemplo, chan int ou chan string, mas um canal pode ser feito para qualquer tipo e, além disso, pode ser também um tipo personalizado e interfaces vazias {}.</p>\n<p>Um canal é uma <em>fila de mensagens tipadas</em>: dados podem ser transmitidos por meio dele. Trata-se de uma estrutura FIFO(First in First Out), o que significa que preserva a ordem dos itens enviados para ele.</p>\n<p>Além disso, um canal é uma referência, o que significa que devemos usar a função make() para alocar memória para ele. Aqui está um exemplo de uma declaração de canal chamado ch1 para strings, seguido pela sua instanciação:</p>\n<pre>var ch1 chan string<br>ch1 = make(chan string)</pre>\n<p>Ou se estiver com pressa podemos escrever:</p>\n<pre>ch1 := make(chan string)</pre>\n<p>Os canais são objetos de primeira classe. Eles podem ser armazenados em variáveis, passados como argumentos para funções, retornados de funções e enviados por canais. Além disso, eles são digitados, permitindo que o sistema de tipos detecte erros de programação, como tentar enviar um ponteiro por um canal de inteiros.</p>\n<h3>Fechando um canal</h3>\n<p>Uma vez que começamos a usar canais, é uma boa prática fechar o mesmo. Portanto, para fechar usamos o seguinte comando.</p>\n<pre>close(ch)</pre>\n<h3>Operador de Comunicação</h3>\n<p>Vamos agora olhar como funciona o operador de comunicação entre canais dentro do Go. Este tipo de operador representa transmissão de dados e de maneira intuitiva, ou seja, a informação flui na direção da seta.</p>\n<h4>Para um canal(enviando dados)</h4>\n<p>A operação ch&lt;-int1 mostra que a variável int1 é enviada pelo canal ch (operador binário, infixo, que significa enviar).</p>\n<h4>De uma canal (recpção)</h4>\n<p>A operação int2 = &lt;- ch mostra que a variável int2 recebe dados (obtém um novo valor) do canal ch (operador de prefixo unário, prefixo significa receber). Isso supõe que int2 já esteja declarado; caso contrário, pode ser escrito como: int2 := &lt;- ch. Outra forma &lt;- ch pode ser usada para obter o (próximo) valor do canal. Esse valor é efetivamente descartado, mas pode ser testado. É por isso que o seguinte código.</p>\n<pre>if &lt;-ch != 1000{<br>  ...<br>}</pre>\n<p>O mesmo operador &lt;- é usado para enviar e receber, mas Go descobre o que fazer dependendo dos operandos. Embora não seja necessário, para facilitar a leitura, o nome do canal geralmente começa com ch ou contém chan.</p>\n<p><em>As operações </em><em>enviar e </em><em>receber do canal são atômicas, o que significa que elas sempre são concluídas sem interrupção.</em></p>\n<p>A utilização do operador de comunicação é ilustrada no seguinte exemplo:</p>\n<pre>package main<br>import (<br>  \"fmt\"<br>  \"time\"<br>)<br>func main() {<br>  ch := make(chan string)<br>  go sendData(ch) // chamando goroutine para enviar os dados<br>  go getData(ch)  // chamando goroutine para receber os dados<br>  time.Sleep(1e9)<br>}<br>func sendData(ch chan string) { // enviando dados para o canal ch<br>  ch &lt;- \"Washington\"<br>  ch &lt;- \"Tripoli\"<br>  ch &lt;- \"London\"<br>  ch &lt;- \"Beijing\"<br>  ch &lt;- \"Tokyo\"<br>}<br>func getData(ch chan string) {<br>  var input string<br>  for {<br>    input = &lt;-ch // recebendo dados enviados para o canal ch<br>    fmt.Printf(\"%s \", input)<br>  }<br>  close(ch) // fecha o canal<br>}</pre>\n<p>No bloco principal main() do código, presente na <strong>linha 8</strong>, é criado um canal chamado ch para troca de mensagens do tipo string. Em seguida, duas goroutines são iniciadas: sendData() (na <strong>linha 9</strong>) envia <strong>5</strong> strings através do canal ch (veja a implementação da <strong>linha 14</strong> até a <strong>linha 20</strong>), e getData() (na <strong>linha 10</strong>) as recebe uma a uma na variável input (na <strong>linha 25</strong>) e imprime o conteúdo recebido (na <strong>linha 26</strong>). Para que duas goroutines possam se comunicar, é necessário passar o mesmo canal como parâmetro para ambas. Experimente o que acontece ao comentar a linha time.Sleep(1e9). <em>Lembre-se também de comentar a importação do pacote </em><em>time, caso contrário o código não irá compilar.</em></p>\n<p>É importante ressaltar a necessidade de sincronização entre as goroutines:</p>\n<ul>\n<li>A função main() aguarda 1 segundo para permitir que ambas as goroutines sejam concluídas. Caso contrário, sendData() não terá oportunidade de produzir sua saída.</li>\n<li>getData() trabalha com um loop infinito, que é interrompido somente quando sendData() termina e o canal ch está vazio.</li>\n<li>Caso sejam removidas uma ou todas as palavras-chave go, o programa deixará de funcionar e o tempo de execução do Go lançará um erro:</li>\n<li>--- Error run &lt;path&gt; with code Crashed Fatal error: all goroutines are asleep - deadlock!</li>\n</ul>\n<p>Essa ocorrência se dá pelo fato de o tempo de execução do Go ser capaz de detectar que todas as goroutines (ou talvez apenas uma, neste caso) estão aguardando por algo (seja escrever em um canal ou ser capaz de ler de um canal), impedindo assim o avanço do programa. Trata-se de uma forma de impasse (deadlock) que o tempo de execução é capaz de identificar.</p>\n<blockquote><em>Observação: Evite utilizar declarações de impressão para indicar a ordem de envio e recebimento em um canal. Essa abordagem pode gerar resultados fora de ordem devido ao atraso entre a declaração de impressão e a efetivação do envio e recebimento pelo canal.</em></blockquote>\n<h3>Em resumo</h3>\n<p>As goroutines são unidades leves de execução gerenciadas pelo runtime do Go. Elas permitem que tarefas sejam executadas de forma assíncrona e concorrente, aproveitando ao máximo os recursos do processador. A criação e destruição de goroutines são de baixo custo, o que permite uma abordagem flexível para a concorrência.</p>\n<p>Para que as goroutines se comuniquem e sincronizem, o Go utiliza os channels. Os channels são canais de comunicação e sincronização entre as goroutines, permitindo a troca segura de dados. Eles garantem que apenas uma goroutine tenha acesso aos dados em um determinado momento, evitando condições de corrida e problemas de concorrência.</p>\n<p>Em resumo, o Go se destaca como uma linguagem de programação moderna, eficiente e fácil de usar, especialmente no contexto da concorrência. Com suas goroutines e channels, o Go fornece um modelo de programação concorrente e paralela poderoso, permitindo que os desenvolvedores aproveitem ao máximo os recursos do sistema e criem software de alta performance.</p>\n<h3>Referencias</h3>\n<ul>\n<li><a href=\"https://a.co/d/afh6i4x\">A Linguagem de Programação Go</a></li>\n<li><a href=\"https://a.co/d/14Jq9fX\">The Way To Go</a></li>\n</ul>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=85b6a127b12f\" width=\"1\" height=\"1\" alt=\"\">\n","content":"\n<h4>Como as goroutines e channels tornam o Go poderoso.</h4>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/740/1*rxDdNJHiz1R38J_JEz23Zw.jpeg\"></figure><p>Go é uma linguagem de programação desenvolvida no início dos anos 2000 pelos engenheiros da Google, Robert Griesemer, Rob Pike e Ken Thompson. O objetivo principal do desenvolvimento do Go era criar uma linguagem de programação moderna, eficiente e fácil de usar, adequada para o desenvolvimento de software escalável e de alto desempenho. O Go foi inspirado por linguagens como C, C ++, Java e C #. Ela mantém a sintaxe do C e, ao mesmo tempo, incorpora recursos de linguagens dinâmicas, como Python e Ruby.</p>\n<p>Uma das grandes vantagens do Go é o seu suporte nativo a concorrência e paralelismo. A concorrência é obtida através do conceito de Goroutines, que segundo a documentação oficial é “uma thread leve gerenciada pelo tempo de execução do Go”. Discutiremos com mais detalhes como isso pode ser feito.</p>\n<p>Além da Goroutines, temos as channels (“canais”) usados para a comunicação e sincronização entre goroutines. Os canais permitem que as goroutines troquem dados de maneira segura e coordenada, evitando condições de corrida e problemas de concorrência.</p>\n<p>Neste artigo, exploraremos dois dos principais pilares da concorrência no Go: as goroutines e os channels. As goroutines são responsáveis por permitir a execução assíncrona e leve de tarefas, enquanto os channels possibilitam a comunicação e a sincronização entre essas tarefas concorrentes.</p>\n<p>Descobriremos como as goroutines podem ser criadas e gerenciadas eficientemente, garantindo um aproveitamento máximo dos recursos do processador. Além disso, veremos como os channels facilitam a troca segura de dados entre as goroutines, evitando problemas comuns, como condições de corrida.</p>\n<h3>Goroutines: Execução leve e assíncrona</h3>\n<p>Antes de abordarmos o assunto principal deste artigo, é importante entendermos brevemente o que é concorrência e paralelismo, bem como as diferenças entre eles.</p>\n<ul>\n<li>\n<strong><em>Concorrência</em></strong><em> refere-se à execução aparentemente simultânea de múltiplas tarefas em um mesmo ambiente. Isso permite que diferentes partes de um programa sejam executadas em paralelo, compartilhando recursos e melhorando a eficiência do sistema.</em>\n</li>\n<li>\n<strong><em>Paralelismo </em></strong><em>envolve a execução real simultânea de tarefas em recursos de processamento distintos. Ao dividir uma tarefa em partes menores, chamadas de threads ou processos, essas partes podem ser executadas independentemente em paralelo, aproveitando ao máximo os recursos disponíveis.</em>\n</li>\n</ul>\n<p>Quando lidamos com tarefas concorrentes, a complexidade aumenta, pois estamos trabalhando com memória compartilhada, onde diferentes threads podem manipulá-la de maneiras imprevisíveis, resultando em erros não reproduzíveis e em resultados aleatórios, conhecidos como condições de corrida.</p>\n<p>A solução para esse problema reside em sincronizar as diferentes threads e bloquear os dados para que apenas uma thread possa modificá-los de cada vez. A linguagem Go possui recursos para bloqueio em sua biblioteca padrão, por meio do pacote “sync”, quando são necessários bloqueios em código de baixo nível. No entanto, experiências anteriores em engenharia de software mostraram que esse modelo leva a uma programação complexa e propensa a erros, além de diminuir o desempenho. Portanto, esse modelo clássico não é adequado para a programação moderna em multicore e multiprocessadores, onde o modelo “thread-per-connection” não é eficiente o suficiente.</p>\n<p>O Go adota um paradigma diferente, mais adequado para muitos casos, conhecido como Processos Sequenciais Comunicantes (CSP, inventado por C.A.R. Hoare) ou o modelo de passagem de mensagens, aplicado em outras linguagens, como Erlang.</p>\n<p>As partes de um aplicativo executadas são simultaneamente chamadas de goroutines em Go. Elas são essencialmente computações executadas em simultâneo. Não há uma correspondência direta entre uma goroutine e uma thread do sistema operacional: uma goroutine é mapeada para (ou multiplexada por) uma ou mais threads, conforme a disponibilidade. O escalonador de goroutines do Go cuida dessa execução.</p>\n<p>As goroutines são executadas no mesmo espaço de endereços, o que significa que o acesso à memória compartilhada deve ser sincronizado. Embora seja possível usar o pacote sync para sincronização, essa abordagem é altamente desencorajada. Em vez disso, o Go utiliza “channels” para sincronizar goroutines.</p>\n<p>Channels serão discutidos com mais detalhes na próxima seção.</p>\n<p>Dessa forma, no Go, as goroutines são a base da concorrência e do paralelismo. Elas permitem a execução de tarefas de forma assíncrona e leve, garantindo um alto grau de eficiência e escalabilidade. Nesta seção, exploraremos em detalhes o conceito e o funcionamento das goroutines.</p>\n<h4>O que são Goroutines</h4>\n<p>As goroutines são unidades de execução leves gerenciadas pelo runtime do Go. Ao contrário das threads tradicionais, elas são extremamente leves, permitindo a criação de centenas, milhares e até milhões delas em um único programa.</p>\n<p>As goroutines são executadas em um único thread chamado “máquina de execução de goroutines” (<em>goroutine scheduler</em>). Essa máquina de execução é responsável por escalonar e distribuir as goroutines nos núcleos de processamento disponíveis, garantindo uma execução eficiente e concorrente.</p>\n<p>Comparadas às threads tradicionais, as goroutines apresentam várias vantagens significativas. Por serem leves em termos de consumo de memória, as goroutines podem ser criadas em grande escala sem sobrecarregar o sistema. Além disso, o custo de criação e destruição de goroutines é muito baixo, permitindo uma abordagem mais flexível para a concorrência.</p>\n<p>Uma goroutine é implementada como uma função ou método (também pode ser uma função anônima ou lambda) e é chamada (invocada) com a palavra-chave “go”. Isso inicia a execução da função de forma concorrente com o cálculo atual, mas no mesmo espaço de endereço e com sua própria pilha. Por exemplo:</p>\n<pre>func main() {<br>    go minhaFuncao() // Criando uma goroutine<br>    // Restante do código principal<br>}<br>func minhaFuncao() {<br>    // Lógica da função<br>}<br></pre>\n<p>A pilha de uma goroutine é gerenciada de maneira eficiente, crescendo e diminuindo conforme o necessário. Não há possibilidade de estouro de pilha e o programador não precisa se preocupar com o tamanho da pilha. Quando a goroutine termina, ela sai silenciosamente, o que significa que nada é retornado para a função que a iniciou. A função main(), que todo programa Go deve ter, também pode ser vista como uma goroutine, embora não seja iniciada com go. As goroutines podem ser executadas durante a inicialização do programa (na função init()).</p>\n<p>Uma goroutine em execução pode interromper a si mesma chamando runtime.Goexit(), embora isso raramente seja necessário. Quando uma goroutine é muito intensiva em processamento, você pode chamar periodicamente runtime.Gosched() em seus loops de cálculo. Isso cede o processador, permitindo que outras goroutines sejam executadas. Isso não suspende a goroutine atual, então a execução é retomada automaticamente. Ao usar Gosched(), os cálculos são distribuídos de forma mais equilibrada e a comunicação não fica prejudicada.</p>\n<h3>Channels: Comunicação e sincronização entre goroutines</h3>\n<p>Para podermos tirar o máximo proveito das goroutines, é preciso que elas se comuniquem, já que as goroutines não se comunicam por padrão. Isso pode ser feito por meio do compartilhamento de variáveis, mas isso é extremamente complexo, já que essa forma de trabalhar apresenta todas as dificuldades com memória compartilhada em multithreading. Para isso, o <strong>Go</strong> introduz o que chamamos de <em>channel</em>, que seja canal (conduíte) que conecta canais concorrentes para ser possível enviar dados e lidar com a comunicação entre as goroutines, dessa forma evitamos os problemas da memória compartilhada. Já que o ato de comunicação mediante um canal garante a sincronização; não há necessidade de sincronização explícita por meio de bloqueio de nada.</p>\n<p>Os dados são transmitidos nos canais: <em>apenas uma goroutine tem acesso a um item de dados a qualquer momento: portanto, corridas de dados não podem ocorrer, por design</em>. A propriedade dos dados (ou seja, a capacidade de lê-los e escrevê-los) é repassada.</p>\n<p>A forma genérica de se declarar um canal em go é</p>\n<pre>var identifier chan datatype</pre>\n<p>Ao declarar um canal, seu valor inicial sera nil.</p>\n<p>Um canal só pode transmitir dados de apenas um tipo, por exemplo, chan int ou chan string, mas um canal pode ser feito para qualquer tipo e, além disso, pode ser também um tipo personalizado e interfaces vazias {}.</p>\n<p>Um canal é uma <em>fila de mensagens tipadas</em>: dados podem ser transmitidos por meio dele. Trata-se de uma estrutura FIFO(First in First Out), o que significa que preserva a ordem dos itens enviados para ele.</p>\n<p>Além disso, um canal é uma referência, o que significa que devemos usar a função make() para alocar memória para ele. Aqui está um exemplo de uma declaração de canal chamado ch1 para strings, seguido pela sua instanciação:</p>\n<pre>var ch1 chan string<br>ch1 = make(chan string)</pre>\n<p>Ou se estiver com pressa podemos escrever:</p>\n<pre>ch1 := make(chan string)</pre>\n<p>Os canais são objetos de primeira classe. Eles podem ser armazenados em variáveis, passados como argumentos para funções, retornados de funções e enviados por canais. Além disso, eles são digitados, permitindo que o sistema de tipos detecte erros de programação, como tentar enviar um ponteiro por um canal de inteiros.</p>\n<h3>Fechando um canal</h3>\n<p>Uma vez que começamos a usar canais, é uma boa prática fechar o mesmo. Portanto, para fechar usamos o seguinte comando.</p>\n<pre>close(ch)</pre>\n<h3>Operador de Comunicação</h3>\n<p>Vamos agora olhar como funciona o operador de comunicação entre canais dentro do Go. Este tipo de operador representa transmissão de dados e de maneira intuitiva, ou seja, a informação flui na direção da seta.</p>\n<h4>Para um canal(enviando dados)</h4>\n<p>A operação ch&lt;-int1 mostra que a variável int1 é enviada pelo canal ch (operador binário, infixo, que significa enviar).</p>\n<h4>De uma canal (recpção)</h4>\n<p>A operação int2 = &lt;- ch mostra que a variável int2 recebe dados (obtém um novo valor) do canal ch (operador de prefixo unário, prefixo significa receber). Isso supõe que int2 já esteja declarado; caso contrário, pode ser escrito como: int2 := &lt;- ch. Outra forma &lt;- ch pode ser usada para obter o (próximo) valor do canal. Esse valor é efetivamente descartado, mas pode ser testado. É por isso que o seguinte código.</p>\n<pre>if &lt;-ch != 1000{<br>  ...<br>}</pre>\n<p>O mesmo operador &lt;- é usado para enviar e receber, mas Go descobre o que fazer dependendo dos operandos. Embora não seja necessário, para facilitar a leitura, o nome do canal geralmente começa com ch ou contém chan.</p>\n<p><em>As operações </em><em>enviar e </em><em>receber do canal são atômicas, o que significa que elas sempre são concluídas sem interrupção.</em></p>\n<p>A utilização do operador de comunicação é ilustrada no seguinte exemplo:</p>\n<pre>package main<br>import (<br>  \"fmt\"<br>  \"time\"<br>)<br>func main() {<br>  ch := make(chan string)<br>  go sendData(ch) // chamando goroutine para enviar os dados<br>  go getData(ch)  // chamando goroutine para receber os dados<br>  time.Sleep(1e9)<br>}<br>func sendData(ch chan string) { // enviando dados para o canal ch<br>  ch &lt;- \"Washington\"<br>  ch &lt;- \"Tripoli\"<br>  ch &lt;- \"London\"<br>  ch &lt;- \"Beijing\"<br>  ch &lt;- \"Tokyo\"<br>}<br>func getData(ch chan string) {<br>  var input string<br>  for {<br>    input = &lt;-ch // recebendo dados enviados para o canal ch<br>    fmt.Printf(\"%s \", input)<br>  }<br>  close(ch) // fecha o canal<br>}</pre>\n<p>No bloco principal main() do código, presente na <strong>linha 8</strong>, é criado um canal chamado ch para troca de mensagens do tipo string. Em seguida, duas goroutines são iniciadas: sendData() (na <strong>linha 9</strong>) envia <strong>5</strong> strings através do canal ch (veja a implementação da <strong>linha 14</strong> até a <strong>linha 20</strong>), e getData() (na <strong>linha 10</strong>) as recebe uma a uma na variável input (na <strong>linha 25</strong>) e imprime o conteúdo recebido (na <strong>linha 26</strong>). Para que duas goroutines possam se comunicar, é necessário passar o mesmo canal como parâmetro para ambas. Experimente o que acontece ao comentar a linha time.Sleep(1e9). <em>Lembre-se também de comentar a importação do pacote </em><em>time, caso contrário o código não irá compilar.</em></p>\n<p>É importante ressaltar a necessidade de sincronização entre as goroutines:</p>\n<ul>\n<li>A função main() aguarda 1 segundo para permitir que ambas as goroutines sejam concluídas. Caso contrário, sendData() não terá oportunidade de produzir sua saída.</li>\n<li>getData() trabalha com um loop infinito, que é interrompido somente quando sendData() termina e o canal ch está vazio.</li>\n<li>Caso sejam removidas uma ou todas as palavras-chave go, o programa deixará de funcionar e o tempo de execução do Go lançará um erro:</li>\n<li>--- Error run &lt;path&gt; with code Crashed Fatal error: all goroutines are asleep - deadlock!</li>\n</ul>\n<p>Essa ocorrência se dá pelo fato de o tempo de execução do Go ser capaz de detectar que todas as goroutines (ou talvez apenas uma, neste caso) estão aguardando por algo (seja escrever em um canal ou ser capaz de ler de um canal), impedindo assim o avanço do programa. Trata-se de uma forma de impasse (deadlock) que o tempo de execução é capaz de identificar.</p>\n<blockquote><em>Observação: Evite utilizar declarações de impressão para indicar a ordem de envio e recebimento em um canal. Essa abordagem pode gerar resultados fora de ordem devido ao atraso entre a declaração de impressão e a efetivação do envio e recebimento pelo canal.</em></blockquote>\n<h3>Em resumo</h3>\n<p>As goroutines são unidades leves de execução gerenciadas pelo runtime do Go. Elas permitem que tarefas sejam executadas de forma assíncrona e concorrente, aproveitando ao máximo os recursos do processador. A criação e destruição de goroutines são de baixo custo, o que permite uma abordagem flexível para a concorrência.</p>\n<p>Para que as goroutines se comuniquem e sincronizem, o Go utiliza os channels. Os channels são canais de comunicação e sincronização entre as goroutines, permitindo a troca segura de dados. Eles garantem que apenas uma goroutine tenha acesso aos dados em um determinado momento, evitando condições de corrida e problemas de concorrência.</p>\n<p>Em resumo, o Go se destaca como uma linguagem de programação moderna, eficiente e fácil de usar, especialmente no contexto da concorrência. Com suas goroutines e channels, o Go fornece um modelo de programação concorrente e paralela poderoso, permitindo que os desenvolvedores aproveitem ao máximo os recursos do sistema e criem software de alta performance.</p>\n<h3>Referencias</h3>\n<ul>\n<li><a href=\"https://a.co/d/afh6i4x\">A Linguagem de Programação Go</a></li>\n<li><a href=\"https://a.co/d/14Jq9fX\">The Way To Go</a></li>\n</ul>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=85b6a127b12f\" width=\"1\" height=\"1\" alt=\"\">\n","enclosure":{},"categories":["paralelismo","programação","go","concorrência"]},{"title":"Conhecendo a internet","pubDate":"2023-05-26 21:27:07","link":"https://medium.com/@rgribeiro/conhecendo-a-internet-54c0afb9e09d?source=rss-303f8669abf9------2","guid":"https://medium.com/p/54c0afb9e09d","author":"Rafael Ribeiro","thumbnail":"https://cdn-images-1.medium.com/max/1024/0*4u0iEzCl8HFovQYe","description":"\n<p>Um breve resumo</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*4u0iEzCl8HFovQYe\"><figcaption>Photo by <a href=\"https://unsplash.com/@nasa?utm_source=medium&amp;utm_medium=referral\">NASA</a> on <a href=\"https://unsplash.com/?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>Nas últimas semanas, tenho me dedicado aos estudos sobre redes de computadores por meio do curso “Grokking Computer Networking for Software Engineers” oferecido pela Educative.io. Esse curso abrange os fundamentos de redes, programação de sockets em Python, utilização de ferramentas de linha de comando e explora os protocolos em cada camada. Além disso, ele oferece uma abordagem prática para a implementação de protocolos de rede que envolvem processamento distribuído. Assim, decidi fazer uma série de artigos abordando o conteúdo que aprenderei.</p>\n<h3>O que é a internet?</h3>\n<p>Desde seu surgimento, a internet desempenha um papel fundamental em nossas vidas, sendo difícil imaginar uma existência sem ela. Estamos constantemente dependentes dela para o sustento, rotinas diárias e entretenimento, tornando-se praticamente um serviço público essencial.</p>\n<p>Mas como ela realmente funciona? O que acontece nos bastidores? Aqui é o lugar ideal para obter essas respostas! A internet é uma intricada rede global de computadores interligados.</p>\n<h3>Mas primeiro, o que é uma rede?</h3>\n<p>Uma rede é oficialmente definida como um grupo ou sistema de pessoas, ou itens interconectados.</p>\n<p>Em outras palavras, estações de trem conectadas por trilhos formam uma rede <em>ferroviária</em>, enquanto pessoas que se seguem no Twitter constituem uma rede social online.</p>\n<p>Da mesma forma, computadores conectados entre si por meio de rádio, cabos ou conexões sem fio formam uma rede de computadores.</p>\n<h4>Por que Redes de Computadores?</h4>\n<p>As redes de computadores têm dois propósitos principais: <strong>comunicação </strong>usando computadores e <strong>compartilhamento de recursos.</strong> A internet permite fazer essas duas coisas em diferentes redes de computadores.</p>\n<h4>A Internet</h4>\n<p>A internet é basicamente uma rede composta por várias redes de computadores.</p>\n<p>Assim, seu computador pessoal está conectado a outros computadores em sua casa ou local de trabalho, formando uma pequena rede de computadores, que, por sua vez, está conectada a outras redes de computadores. Desse modo, a internet global abrange uma intricada teia de redes de computadores interconectadas.</p>\n<h3>Uma rápida história da Internet</h3>\n<h4>Mas por que aprender a história?</h4>\n<ul>\n<li>Conheça os erros cometidos durante o desenvolvimento da internet e evite repeti-los.</li>\n<li>Entenda por que algumas coisas são projetadas e funcionam da maneira que funcionam hoje.</li>\n<li>Por último, é legal!</li>\n</ul>\n<h4><strong>Os anos 50: Guerra fria</strong></h4>\n<p>O nascimento da Internet remonta a meados do século passado.</p>\n<ul>\n<li>Os EUA estavam no meio de uma guerra fria com a União Soviética e ambas as nações tentavam obter vantagem sobre a outra.</li>\n<li>Em 1957, os soviéticos <a href=\"http://history.nasa.gov/sputnik/\">lançaram o Sputnik,</a> o primeiro satélite do mundo, nos impulsionando para a era espacial.</li>\n<li>Isso pegou os EUA desprevenidos e, em resposta, o governo dos EUA criou a <a href=\"https://en.wikipedia.org/wiki/DARPA\">ARPA </a>(Agência de Projetos de Pesquisa Avançada), que foi mandatável com a responsabilidade do desenvolvimento tecnológico e avanço científico do país.</li>\n</ul>\n<h4><strong>Os anos 60–70: ARPANET</strong></h4>\n<ul>\n<li>A ARPA foi concebida para facilitar a pesquisa, mas seus computadores não podiam se comunicar.</li>\n<li>A ARPA enviou uma solicitação para o projeto de uma rede que permitiria que computadores em todo o país se comunicassem.</li>\n<li>Uma rede chamada ARPANET foi desenvolvida ao longo de um ano. Em setembro de 1969, a ARPANET foi ativada. Os primeiros quatro nós estavam na UCLA, Stanford, MIT e na Universidade de Utah. Nos anos 70, surgiram outras redes de computadores como a ARPANET.</li>\n<li>Embora os computadores em uma rede pudessem se comunicar por meio de uma forma padrão de comunicação definida pelo administrador de rede de cada rede, os computadores em redes diferentes não podiam se comunicar, pois cada rede tinha seu próprio idioma ou — mais formalmente — protocolo.</li>\n<li>Então, um protocolo padronizado chamado Transmission Control Protocol foi inventado (<a href=\"https://tools.ietf.org/html/rfc675\">RFC 675</a>).</li>\n<li>Foi também em <a href=\"https://tools.ietf.org/html/rfc675\">RFC 675 </a>que o termo “Internet” foi usado pela primeira vez. RFCs posteriores continuaram o uso.</li>\n</ul>\n<blockquote>Você sabia? A Agência de Projetos de Pesquisa Avançada (ARPA) agora é conhecida como Agência de Projetos de Pesquisa Avançada de Defesa (DARPA) para enfatizar seu foco na defesa!</blockquote>\n<h4><strong>Os anos 80: protocolos</strong></h4>\n<ul>\n<li>A ARPANET foi totalmente migrada para TCP/IP.</li>\n<li>À medida que entramos na década de 1980, os computadores foram adicionados à Internet em uma taxa crescente. Esses computadores eram principalmente de organizações governamentais, acadêmicas e de pesquisa. Para grande surpresa dos engenheiros, a popularidade inicial da Internet foi impulsionada pelo uso do correio eletrônico.</li>\n</ul>\n<h4><strong>Os anos 90: a World Wide Web</strong></h4>\n<ul>\n<li>Durante os anos 90, os pesquisadores do Conselho Europeu de Pesquisa Nuclear (<a href=\"https://home.cern/\">CERN</a>) sentiram a necessidade de compartilhamento automatizado de suas descobertas entre seus computadores. O CERN tinha documentos que faziam referência cruzada a outros documentos. Então, havia esses (hiper)links entre documentos.</li>\n<li>Confira uma versão restaurada do <a href=\"http://line-mode.cern.ch/www/hypertext/WWW/TheProject.html\">primeiro site de todos os tempos</a>!</li>\n<li>Posteriormente, foram realizadas aplicações educacionais, comerciais e tantas outras.</li>\n<li>A World Wide Web ficou ainda mais popular com o advento de navegadores como <strong>Mosaic </strong>e <strong>Netscape</strong>, que permitiram combinar gráficos com navegação na web!</li>\n</ul>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/1*b3YfROMilDvnLCEjg_gH7w.jpeg\"><figcaption>Em 1990, Tim Berners-Lee apresentou seu projeto World Wide Web para armazenar e recuperar esses documentos interconectados.</figcaption></figure><blockquote>“…Criar a web foi realmente um ato de desespero porque a situação sem ela era muito difícil quando eu estava trabalhando no CERN mais tarde. A maior parte da tecnologia envolvida na web, como o hipertexto, como a Internet, objetos de texto com várias fontes, já foi projetada. Eu só tinha que colocá-los juntos. Foi um passo de generalização, indo para um nível mais alto de abstração, pensando em todos os sistemas de documentação existentes como sendo possivelmente parte de um sistema de documentação imaginário maior.” — Tim Berners Lee</blockquote>\n<p><strong>Search Engines</strong></p>\n<p>Outro fato engraçado é que, inicialmente, não havia mecanismos de busca.</p>\n<p>Então, como você encontraria um site? Bem, você não poderia. Ou você sabia, ou não. Claro, você pode acessar um site por acidente ou seguindo um link de outro site que você conhece.</p>\n<p>Então, as pessoas começaram a criar <a href=\"https://en.wikipedia.org/wiki/World_Wide_Web_Virtual_Library\">índices estáticos da web</a> — uma lista categorizada de sites. As pessoas sentavam e clicavam aleatoriamente em links para encontrar páginas da web e adicionar links ao seu índice. Mas isso não poderia escalar. Então, eventualmente, os mecanismos de busca foram “inventados”.</p>\n<p>Altavista e Yahoo! Estavam entre os motores de busca anteriores. De acordo com este <a href=\"https://en.wikipedia.org/wiki/Timeline_of_web_search_engines\">artigo da Wikipedia</a>, o primeiro índice automatizado da Web foi o World Wide Web Wanderer. Logo depois, o primeiro mecanismo de busca na web, o W3Catalog, foi inventado.</p>\n<h4><strong>O século XXI: a era da Internet</strong></h4>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*4JjxDAXaUVBDAJIF\"><figcaption>Photo by <a href=\"https://unsplash.com/@ilgmyzin?utm_source=medium&amp;utm_medium=referral\">ilgmyzin</a> on <a href=\"https://unsplash.com/?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>E agora aqui estamos. Em uma época em que todos os nossos dispositivos rodam na Internet, até torradeiras para alguns — a era da Internet das Coisas está aqui! A vida sem ela parece quase inconcebível.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=54c0afb9e09d\" width=\"1\" height=\"1\" alt=\"\">\n","content":"\n<p>Um breve resumo</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*4u0iEzCl8HFovQYe\"><figcaption>Photo by <a href=\"https://unsplash.com/@nasa?utm_source=medium&amp;utm_medium=referral\">NASA</a> on <a href=\"https://unsplash.com/?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>Nas últimas semanas, tenho me dedicado aos estudos sobre redes de computadores por meio do curso “Grokking Computer Networking for Software Engineers” oferecido pela Educative.io. Esse curso abrange os fundamentos de redes, programação de sockets em Python, utilização de ferramentas de linha de comando e explora os protocolos em cada camada. Além disso, ele oferece uma abordagem prática para a implementação de protocolos de rede que envolvem processamento distribuído. Assim, decidi fazer uma série de artigos abordando o conteúdo que aprenderei.</p>\n<h3>O que é a internet?</h3>\n<p>Desde seu surgimento, a internet desempenha um papel fundamental em nossas vidas, sendo difícil imaginar uma existência sem ela. Estamos constantemente dependentes dela para o sustento, rotinas diárias e entretenimento, tornando-se praticamente um serviço público essencial.</p>\n<p>Mas como ela realmente funciona? O que acontece nos bastidores? Aqui é o lugar ideal para obter essas respostas! A internet é uma intricada rede global de computadores interligados.</p>\n<h3>Mas primeiro, o que é uma rede?</h3>\n<p>Uma rede é oficialmente definida como um grupo ou sistema de pessoas, ou itens interconectados.</p>\n<p>Em outras palavras, estações de trem conectadas por trilhos formam uma rede <em>ferroviária</em>, enquanto pessoas que se seguem no Twitter constituem uma rede social online.</p>\n<p>Da mesma forma, computadores conectados entre si por meio de rádio, cabos ou conexões sem fio formam uma rede de computadores.</p>\n<h4>Por que Redes de Computadores?</h4>\n<p>As redes de computadores têm dois propósitos principais: <strong>comunicação </strong>usando computadores e <strong>compartilhamento de recursos.</strong> A internet permite fazer essas duas coisas em diferentes redes de computadores.</p>\n<h4>A Internet</h4>\n<p>A internet é basicamente uma rede composta por várias redes de computadores.</p>\n<p>Assim, seu computador pessoal está conectado a outros computadores em sua casa ou local de trabalho, formando uma pequena rede de computadores, que, por sua vez, está conectada a outras redes de computadores. Desse modo, a internet global abrange uma intricada teia de redes de computadores interconectadas.</p>\n<h3>Uma rápida história da Internet</h3>\n<h4>Mas por que aprender a história?</h4>\n<ul>\n<li>Conheça os erros cometidos durante o desenvolvimento da internet e evite repeti-los.</li>\n<li>Entenda por que algumas coisas são projetadas e funcionam da maneira que funcionam hoje.</li>\n<li>Por último, é legal!</li>\n</ul>\n<h4><strong>Os anos 50: Guerra fria</strong></h4>\n<p>O nascimento da Internet remonta a meados do século passado.</p>\n<ul>\n<li>Os EUA estavam no meio de uma guerra fria com a União Soviética e ambas as nações tentavam obter vantagem sobre a outra.</li>\n<li>Em 1957, os soviéticos <a href=\"http://history.nasa.gov/sputnik/\">lançaram o Sputnik,</a> o primeiro satélite do mundo, nos impulsionando para a era espacial.</li>\n<li>Isso pegou os EUA desprevenidos e, em resposta, o governo dos EUA criou a <a href=\"https://en.wikipedia.org/wiki/DARPA\">ARPA </a>(Agência de Projetos de Pesquisa Avançada), que foi mandatável com a responsabilidade do desenvolvimento tecnológico e avanço científico do país.</li>\n</ul>\n<h4><strong>Os anos 60–70: ARPANET</strong></h4>\n<ul>\n<li>A ARPA foi concebida para facilitar a pesquisa, mas seus computadores não podiam se comunicar.</li>\n<li>A ARPA enviou uma solicitação para o projeto de uma rede que permitiria que computadores em todo o país se comunicassem.</li>\n<li>Uma rede chamada ARPANET foi desenvolvida ao longo de um ano. Em setembro de 1969, a ARPANET foi ativada. Os primeiros quatro nós estavam na UCLA, Stanford, MIT e na Universidade de Utah. Nos anos 70, surgiram outras redes de computadores como a ARPANET.</li>\n<li>Embora os computadores em uma rede pudessem se comunicar por meio de uma forma padrão de comunicação definida pelo administrador de rede de cada rede, os computadores em redes diferentes não podiam se comunicar, pois cada rede tinha seu próprio idioma ou — mais formalmente — protocolo.</li>\n<li>Então, um protocolo padronizado chamado Transmission Control Protocol foi inventado (<a href=\"https://tools.ietf.org/html/rfc675\">RFC 675</a>).</li>\n<li>Foi também em <a href=\"https://tools.ietf.org/html/rfc675\">RFC 675 </a>que o termo “Internet” foi usado pela primeira vez. RFCs posteriores continuaram o uso.</li>\n</ul>\n<blockquote>Você sabia? A Agência de Projetos de Pesquisa Avançada (ARPA) agora é conhecida como Agência de Projetos de Pesquisa Avançada de Defesa (DARPA) para enfatizar seu foco na defesa!</blockquote>\n<h4><strong>Os anos 80: protocolos</strong></h4>\n<ul>\n<li>A ARPANET foi totalmente migrada para TCP/IP.</li>\n<li>À medida que entramos na década de 1980, os computadores foram adicionados à Internet em uma taxa crescente. Esses computadores eram principalmente de organizações governamentais, acadêmicas e de pesquisa. Para grande surpresa dos engenheiros, a popularidade inicial da Internet foi impulsionada pelo uso do correio eletrônico.</li>\n</ul>\n<h4><strong>Os anos 90: a World Wide Web</strong></h4>\n<ul>\n<li>Durante os anos 90, os pesquisadores do Conselho Europeu de Pesquisa Nuclear (<a href=\"https://home.cern/\">CERN</a>) sentiram a necessidade de compartilhamento automatizado de suas descobertas entre seus computadores. O CERN tinha documentos que faziam referência cruzada a outros documentos. Então, havia esses (hiper)links entre documentos.</li>\n<li>Confira uma versão restaurada do <a href=\"http://line-mode.cern.ch/www/hypertext/WWW/TheProject.html\">primeiro site de todos os tempos</a>!</li>\n<li>Posteriormente, foram realizadas aplicações educacionais, comerciais e tantas outras.</li>\n<li>A World Wide Web ficou ainda mais popular com o advento de navegadores como <strong>Mosaic </strong>e <strong>Netscape</strong>, que permitiram combinar gráficos com navegação na web!</li>\n</ul>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/1*b3YfROMilDvnLCEjg_gH7w.jpeg\"><figcaption>Em 1990, Tim Berners-Lee apresentou seu projeto World Wide Web para armazenar e recuperar esses documentos interconectados.</figcaption></figure><blockquote>“…Criar a web foi realmente um ato de desespero porque a situação sem ela era muito difícil quando eu estava trabalhando no CERN mais tarde. A maior parte da tecnologia envolvida na web, como o hipertexto, como a Internet, objetos de texto com várias fontes, já foi projetada. Eu só tinha que colocá-los juntos. Foi um passo de generalização, indo para um nível mais alto de abstração, pensando em todos os sistemas de documentação existentes como sendo possivelmente parte de um sistema de documentação imaginário maior.” — Tim Berners Lee</blockquote>\n<p><strong>Search Engines</strong></p>\n<p>Outro fato engraçado é que, inicialmente, não havia mecanismos de busca.</p>\n<p>Então, como você encontraria um site? Bem, você não poderia. Ou você sabia, ou não. Claro, você pode acessar um site por acidente ou seguindo um link de outro site que você conhece.</p>\n<p>Então, as pessoas começaram a criar <a href=\"https://en.wikipedia.org/wiki/World_Wide_Web_Virtual_Library\">índices estáticos da web</a> — uma lista categorizada de sites. As pessoas sentavam e clicavam aleatoriamente em links para encontrar páginas da web e adicionar links ao seu índice. Mas isso não poderia escalar. Então, eventualmente, os mecanismos de busca foram “inventados”.</p>\n<p>Altavista e Yahoo! Estavam entre os motores de busca anteriores. De acordo com este <a href=\"https://en.wikipedia.org/wiki/Timeline_of_web_search_engines\">artigo da Wikipedia</a>, o primeiro índice automatizado da Web foi o World Wide Web Wanderer. Logo depois, o primeiro mecanismo de busca na web, o W3Catalog, foi inventado.</p>\n<h4><strong>O século XXI: a era da Internet</strong></h4>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*4JjxDAXaUVBDAJIF\"><figcaption>Photo by <a href=\"https://unsplash.com/@ilgmyzin?utm_source=medium&amp;utm_medium=referral\">ilgmyzin</a> on <a href=\"https://unsplash.com/?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>E agora aqui estamos. Em uma época em que todos os nossos dispositivos rodam na Internet, até torradeiras para alguns — a era da Internet das Coisas está aqui! A vida sem ela parece quase inconcebível.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=54c0afb9e09d\" width=\"1\" height=\"1\" alt=\"\">\n","enclosure":{},"categories":["internet"]},{"title":"Criando um Encurtador de URL","pubDate":"2023-01-23 15:02:41","link":"https://medium.com/@rgribeiro/criando-um-encurtador-de-url-ec554470d649?source=rss-303f8669abf9------2","guid":"https://medium.com/p/ec554470d649","author":"Rafael Ribeiro","thumbnail":"https://cdn-images-1.medium.com/max/830/1*yY_xCZPB6pkwnMrvSAj1Nw.jpeg","description":"\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/830/1*yY_xCZPB6pkwnMrvSAj1Nw.jpeg\"></figure><p>Olá, espero que estejam todos bem. Hoje falarei sobre como planejei e executei a criação de um encurtador de URL e também os próximos planos para que nosso sistema evolua de maneira saudável. Portanto, passaremos desde dos requisitos funcionais e não funcionas e também regra de negócios que nossa aplicação precisa cumprir.</p>\n<h3>O que é Encurtador de URL?</h3>\n<p>Antes de começar, é necessário explicar do que se trata esse tipo de serviço.</p>\n<p>O objetivo de um encurtador de url é bem simples. É um serviço bem conhecido, como, por exemplo, bit.ly ou tinyurl, que encurtar URL longos para URLs mais simples. Assim os usuários serão redirecionados para a URL original quando acessam esses links curtos. Por exemplo, pegue a seguinte URL:</p>\n<pre><a href=\"https://www.linkedin.com/in/rafael-mgr/\">https://www.linkedin.com/in/rafael-mgr/</a></pre>\n<p>Obteremos a seguinte link</p>\n<pre><a href=\"https://tinyurl.com/bdfwpx29\">https://tinyurl.com/bdfwpx29</a></pre>\n<p>Como pode ser visto, o link foi diminuiu drasticamente.</p>\n<p>O encurtamento de URL é usado para otimizar links entre dispositivos, rastrear links individuais para analisar o público, medir o desempenho de campanhas publicitárias ou ocultar URLs originais afiliados.</p>\n<h3>Requisitos funcionais e não funcionais.</h3>\n<p>Podemos seguir e definir quais são os requisitos funcionais e não funcionais e as regras de negócios. Mas antes disso, gostaria de definir o que são.</p>\n<h4>Requisitos Funcionais</h4>\n<p>São requisitos que devem ser atendidos e resolvidos pelo software por meio de funções ou serviços. Alguns exemplos desse tipo de requisitos:</p>\n<ul>\n<li>inserir dados em um formulário</li>\n<li>buscar pratos específicos em um cardápio;</li>\n<li>consultar a situação de um pedido;</li>\n<li>realizar compras;</li>\n<li>comunicar-se com um atendente;</li>\n<li>alterar informações de um registro;</li>\n<li>elaborar relatórios.</li>\n</ul>\n<p>Tudo o que for relacionada a uma ação a ser feita é considerado uma função. Também é importante lembrar que quanto menos ambíguos e mais objetivos forme os requisitos funcionais, maio será a qualidade do software gerado.</p>\n<h4>Requisitos não funcionais</h4>\n<p>Os requisitos não funcionais são todos aqueles relacionados à forma como o software tornará realidade os que está sendo planejado. Assim, enquanto requisitos funcionas estão focados no que será feito, os não funcionais descrevem como serão feitos.</p>\n<p>Dessa forma, todos os pré-requisitos do sistema, de hardware, de software e operacionais são documentados separadamente. Entre as características técnicas que podem ser definidas estão:</p>\n<ul>\n<li>tipo de sistema operacional;</li>\n<li>hardware a ser utilizado;</li>\n<li>processamento;</li>\n<li>consumo de memória;</li>\n<li>conexão;</li>\n<li>banco de dados;</li>\n<li>tipos de dispositivos onde o software pode ser usado.</li>\n</ul>\n<p>Além disso, os requisitos não funcionais podem ser categorizados em 3 tipos, requisitos de produto final, organizacional e externo. Contudo, também há outras categorias, como:</p>\n<ul>\n<li>de eficiência;</li>\n<li>de confiabilidade;</li>\n<li>de portabilidade;</li>\n<li>de entrega;</li>\n<li>de implementação;</li>\n<li>de padrões;</li>\n<li>de inter</li>\n</ul>\n<p>Podemos ir mais afundo nesses quesitos, porém foge um pouco do escopo desse artigo. Para saber mais, esse <a href=\"https://mestresdaweb.com.br/tecnologias/requisitos-funcionais-e-nao-funcionais-o-que-sao/#:~:text=O%20que%20s%C3%A3o%20requisitos%20n%C3%A3o,funcionais%20descrevem%20como%20ser%C3%A3o%20feitos.\">link</a> explica com maiores detalhes como podemos definir e separa os requisitos da nossa aplicação.</p>\n<p>Podemos agora retornar a definições de requisitos da nossa aplicação.</p>\n<p>Nesse primeiro momento, é preciso que seja definido os objetivos do nosso sistema, portanto nosso encurtador tem que atender os seguintes requisitos.</p>\n<p><strong>Requisitos Funcionais:</strong></p>\n<ol>\n<li>Dado um URL, nosso sistema tem que gerar um curto e único “alias” do nome. Esse link dever ser curto o suficiente para ser facilmente copiado e colocas entre aplicações.</li>\n<li>Quando usuários acessarem o link curto, nosso serviço deve redirecionar eles para o link original.</li>\n<li>Usuários devem ter a opção de pegar um link customizado para seu URL</li>\n<li>Os links devem expirar após um intervalo padrão. Os usuários deverem conseguir especificar o tempo de expiração.</li>\n</ol>\n<p><strong>Requisitos não Funcionais:</strong></p>\n<ol>\n<li>O sistema deve ter altamente disponível. Isso é necessário porque, se nosso serviço começar a falhar, os redirecionamentos de URL começarão a falhar.</li>\n<li>O redirecionamento de URL deve acontecer em tempo real com latência mínima.</li>\n<li>Links encurtados não devem ser adivinhados (não previsíveis)</li>\n</ol>\n<p><strong>Requisitos estendidos:</strong></p>\n<ol>\n<li>Análise; por exemplo, quantas vezes um redirecionamento aconteceu?</li>\n<li>Nosso serviço também deve ser acessível por meio de APIs REST por outros serviços.</li>\n</ol>\n<h3>Tráfico e Modelagem da Capacidade</h3>\n<p>Nosso sistema será usado, majoritariamente, em formato de leitura. Haverá mutias solicitações de redirecionamento em comparação com novos encurtamentos de URL. Suponhamos de início uma proporção 100:1 entre leitura e escrita.</p>\n<p><strong>Estimativa de tráfico:</strong> Assumindo, que teremos total de 500 milhões novas encurtamentos de URLs por mês, com proporção de leitura/gravação de 100:1, podemos esperar 50 bilhões de redirecionamentos durante o mesmo período:</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/179/1*LtejIPNTXj4g8_id34ohMA.gif\"></figure><p>Quantas queries por segundo seria feita para nosso sistema? Novos encurtamentos e URLs por segundo:</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/381/1*mJYO0lL1cIijkJuqIGgp7Q.gif\"></figure><p><strong>Estimativas de armazenamento</strong>: Assumiremos que armazenamos cada solicitação de encurtamento de URL (e link encurtado associado) por 5 anos. Como esperarmos ter 500 milhões de novos URLs armazenados todos os meses, o úmero total de objetos que esperarmos armazenar será de 30 bilhões:</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/272/1*89Tqrr9GWbmRK8zbOrvsvg.gif\"></figure><p>Vamos assumir que cada objeto armazenado será de aproximadamente 500 bytes(apenas uma estimativa aproximada — vamos investigar mais tarde). Precisaremos de 15 TB de armazenamento total.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/206/1*1fyIfpJ66yNuVRdho9b0EA.gif\"></figure><p><strong>Estimativas de largura de banda(Bandwidth estimates)</strong> : Para solicitações de gravação, como esperamos 200 novos urls a cada segundo, o total de dados de entrada para nosso serviço será de 100 KB por segundo</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/223/1*ErYRCCNcVJbO5HL9YWWotA.gif\"></figure><p>Para solicitações de leitura, como cada segundo esperamos redirecionamentos de cerca de 20 mil URLs, o total de dados de saída para nosso serviço seria de 10 MB por segundo:</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/221/1*WK-Xj0SKXiZqO19nFWl21w.gif\"></figure><p><strong>Estimativas de memória</strong>: Se quisermos armazenar em cache alguns das URLs quentes acessados com frequência, quanta memória precisaremos para armazená-los? Se seguirmos a regra 80–20, o que significa que 20% das URLs geram 80% do tráfego, gostaríamos de armazenar em cache esses 20% de URLs quentes.</p>\n<p>Como temos 20 mil solicitações por segundos, receberemos 1,7 bilhão de solicitações por dia:</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/319/1*ecC94OzRK0_KDkeMlneALg.gif\"></figure><p>Para armazenar em cache 20% dessas solicitações, precisaremos de 170 GB de memória.</p>\n<p><strong>Estimativas de alto nível</strong>: supondo 500 milhões de novos URLs por mês e proporção de leitura: gravação de 100:1, a seguir está o resumo das estimativas de alto nível para nosso serviço:</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/770/1*MKajaHkhGt1TeE3tokBvcg.png\"></figure><h3>Sistema de APIs</h3>\n<p>Podemos ter SOAP ou REST APIs para expor a funcionalidade do nosso serviço. A seguir, pode ser as definições das APIS para criar e excluir URLs:</p>\n<pre>createURL(api_dev_key, original_url, custom_alias=None, user_name=None, expire_date=None)</pre>\n<p><strong>Parâmetros:</strong></p>\n<ul>\n<li>api_dev_key (string): A chave de desenvolvedor da API de uma conta registrada. Isso será usado para, entre outras coisas, limitar os usuários com base em sua cota alocada.</li>\n<li>original_url (string): URL original a ser encurtado.</li>\n<li>custom_alias (string): chave personalizada opcional para a URL.</li>\n<li>user_name (string): nome de usuário opcional a ser usado na codificação.</li>\n<li>expire_date (string): data de expiração opcional para a URL abreviada</li>\n</ul>\n<p><strong>Retorno</strong>: (string)</p>\n<p>Uma inserção bem-sucedida retorna o URL abreviado; caso contrário, ele retornará um código de erro.</p>\n<pre>deleteURL(api_dev_key, url_key)</pre>\n<p>Onde “url_key” é uma string que representa a URL abreviada a ser recuperada; uma exclusão bem-sucedida retorna ‘URL removido’.</p>\n<p><strong>Como detectamos e prevenimos o abuso</strong>? Um usuário mal-intencionado pode nos tirar do negócio consumindo todas as chaves de URL no design atual. Para evitar abusos, podemos limitar os usuários por meio da api_dev_key. Cada api_dev_key pode ser limitada a um certo número de criações e redirecionamentos de URL por algum período (que pode ser definido para uma duração diferente por chave de desenvolvedor).</p>\n<h3>Design Database</h3>\n<p>Antes de começar, temos algumas observações sobre a natureza dos dados que armazenaremos:</p>\n<ol>\n<li>Precisaremos armazenar bilhões de registros.</li>\n<li>Cada Objeto que é pequeno (menos de 1K)</li>\n<li>Não há relacionamento entres registros., exceto armazena qual usuário criou um URL.</li>\n<li>Nosso serviço é pesado de Leitura</li>\n</ol>\n<h3>Esquema(Schema) do Database</h3>\n<p>É preciso de duas tabelas: uma para armazenar informações sobre os mapeamentos de URL e outra para os dados do usuário que criou link curto.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/463/0*DUlOWL9jCySbXFse.png\"></figure><p>Esquema de banco de dados de encurtamento de URL</p>\n<p>Que tipo de banco de dados devemos usar? Como antecipamos o armazenamento de bilhões de linhas e não precisamos usar relacionamentos entre objetos — um armazenamento NoSQL como DynamoDB, Cassandra ou Riak é uma escolha melhor. Uma escolha NoSQL também seria mais fácil de escalar. Consulte SQL vs NoSQL para obter mais detalhes.</p>\n<h3>Design Básico de Sistema e Algoritmo</h3>\n<p>O problema que estamos resolvendo é como gerar um curta e chave única para uma determinada URL.</p>\n<p>O exemplo dado para o caso TinyURL, a URL abreviada é “<a href=\"https://tinyurl.com/rxcsyr3r%E2%80%9D\">https://tinyurl.com/rxcsyr3r”</a>. Os últimos oito caracteres desta URL constituem a chave curta que queremos gerar. Exploremos duas soluções aqui:</p>\n<h3>1. Codificando a URL</h3>\n<p>Podemos calcular um hash exclusivo (por exemplo, um MD5 ou SHA256, etc ...) do URL fornecido. O hash pode então ser codificado para exibição. Essa codificação pode ser base36 ([a-z ,0–9]) ou base62 ([A-Z, a-z, 0–9]) e se adicionarmos ‘+’ e ‘/’ podemos usar a codificação Base64. Uma pergunta razoável seria: qual deve ser o comprimento da tecla curta? 6, 8 ou 10 caracteres?</p>\n<p>Usando a codificação base64, uma chave de 6 letras resultaria 68,7 bilhões de strings possíveis. Usando a codificação base64, uma chave de 8 letras resultaria em 281 trilhões de strings possíveis.</p>\n<p>Com 68,7 bilhões de strings únicas, suponhamos que seis letras seria suficiente para o nosso sistema.</p>\n<p>Se usarmos o algoritmo MD5 como nossa função de hash, ele produzirá um valor de hash de 128 bits. Após a codificação base64, obteremos uma string com mais de 21 caracteres (já que cada caracteres base64 codifica 6 bits do valor de hash). Agora só temos espaço para 6 (ou 8) caracteres por tecla curta, como vamos escolher nossa chave então? Podemos pegar as primeiras 6 (ou*) letras para a chave. Isso pode resultar em duplicação de chaves; para resolver isso, podemos escolher alguns outros caracteres da string de codificação ou trocar alguns caracteres.</p>\n<p>Quais são os diferentes problemas com a nossa solução? Temos os seguintes problemas como nosso esquema de codificação:</p>\n<ol>\n<li>Se vários usuários inserirem o mesmo URL, eles poderão obter o mesmo URL abreviado, o que não é aceitável.</li>\n<li>E se partes do URL forem codificadas por URL? por exemplo, <a href=\"http://www.educative.io/distributed.php?id=design\">http://www.educative.io/distributed.php?id=design</a> e <a href=\"http://www.educative.io/distributed.php%3Fid%3Ddesign\">http://www.educative.io/distributed.php%3Fid%3Ddesign</a> são idênticos, exceto pela codificação de URL.</li>\n</ol>\n<p><strong>Solução alternativa para os problemas</strong>: podemos anexar um número de sequências crescente a cada URL de entrada para torná-lo exclusivo e, em seguida, gerar seu hash. No entanto, não precisamos armazenar esse número de sequências nos bancos de dados Possíveis problemas com essa abordagem podem se um número de sequências crescentes. Pode transbordar? Acrescentar um número de sequência crescente também afetará o desempenho do serviço.</p>\n<p>Outra solução pode ser anexar o ID do usuário (que deve ser exclusivo) ao URL de entrada. No entanto, se o usuário não tiver feito login, teríamos que pedir ao usuário que escolhesse uma chave de exclusividade. Mesmo depois disso, se tivermos um conflito, teremos que continuar gerando uma chave até obtermos uma única.</p>\n<h3>2. Gerando Chaves offline</h3>\n<p>Podemos ter um <strong>Key Generation Service (KGS)</strong> autônomo que gera strings aleatórias de seis letras antecipadamente e as armazena em um banco de dados (vamos chamá-lo de key-db). Sempre que quisermos encurtar uma URL, pegaremos uma das chaves já geradas e a usaremos. Essa abordagem tornará as coais bastantes simples e rápidas. Não apenas não estamos codificando a URL, mas também não teremos que nos preocupar com duplicações ou colisões. KGS irá certificar-se de que todas as chaves inseridas no key-DB sejam únicas.</p>\n<p><strong>A concorrência pode causar problemas?</strong> Assim que uma chave for usada, ela deve ser marcada no banco de dados para garantir que não seja usada novamente. Se houver vários servidores lendo chaves simultaneamente, poderemos obter um cenário em que dois ou mais servidores tentem ler a mesma chave do banco de dados. Como podemos resolver esse problema de simultaneidade?</p>\n<p>Os servidores podem usar o KGS para ler/marcar chaves no banco de dados. KGS pode usar duas tabelas para armazenar chaves: uma para chaves que ainda não foram usadas e outra para todas as chaves usadas. Assim que o KGS entrega as chaves a um dos servidores, ele pode movê-las para a tabela de chaves usadas. O KGS sempre pode manter algumas chaves na memória para fornecê-las rapidamente sempre que um servidor precisar delas.</p>\n<p>Para simplificar, assim que o KGS carrega algumas chaves na memória, ele pode movê-las para a tabela de chaves usadas. Isso garante que cada servidor obtenha chaves exclusivas. Se o KGS morrer antes de atribuir todas as chaves carregadas a algum servidor, estaremos desperdiçando essas chaves — o que pode ser aceitável, dado o grande número de chaves que temos.</p>\n<p>O KGS também deve certificar-se de não fornecer a mesma chave para vários servidores. Para isso, ele deve sincronizar (ou bloquear) a estrutura de dados que contém as chaves antes de remover as chaves e entregá-las a um servidor.</p>\n<p><strong>Qual seria o tamanho do banco de dados de chave?</strong> Com a codificação base64, podemos gerar 68,7B chaves exclusivas de seis letras. Se precisarmos de um byte para armazenar um caractere alfanumérico, podemos armazenar todas essas chaves em:</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/705/1*C09XJHEWPQrG10mi6pQcqQ.png\"></figure><p><strong>A KGS não é um ponto único de falha?</strong> É sim para resolver isso, podemos ter réplica em espera do KGS. Sempre que o servidor primário morre, o servidor em esperar pode assumir o controle para gerar e fornecer chaves.</p>\n<p><strong>Cada servidor de aplicativos pode armazenar em cache algumas chaves do key-db?</strong> Sim, isso certamente pode acelerar as coisas. Embora neste caso, se o servidor de aplicativos morrer antes de consumir todas as chaves, acabaremos perdendo essas chaves. Isso pode ser aceitável, pois temos 68B teclas exclusivas de seis letras.</p>\n<p><strong>Como realizaríamos uma pesquisa de chave?</strong> Podemos procurar a chave em nosso banco de dados para obter o URL completo. Se estiver presente no banco de dados, emita um status “HTTP 302 Redirect” de volta ao navegador, passando a URL armazenada no campo “Location” da solicitação. Se essa chave não estiver presente em nosso sistema, emita um status “HTTP 404 Not Found” ou redirecione o usuário de volta para a página inicial.</p>\n<p><strong>Devemos impor limites de tamanho aos aliases personalizados?</strong> Nosso serviço oferece suporte a aliases personalizados. Os usuários podem escolher qualquer ‘chave’ que quiserem, mas fornecer um alias personalizado não é obrigatório. No entanto, é razoável (e muitas vezes desejável) impor um limite de tamanho em um alias personalizado para garantir que tenhamos um banco de dados de URL consistente. Suponhamos que os usuários especifiquem no máximo 16 caracteres por chave de cliente (conforme refletido no esquema de banco de dados acima).</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/767/1*skvMqInVYEsTAJtzu5-5Qw.png\"></figure><h3>Particionamento de Dados e Replicação</h3>\n<p>Para ser possível escalar o banco de dados, precisamos particioná-lo para poder armazenar informações sobre bilhões de URLs. Portanto, precisamos desenvolver um esquema de particionamento que divide e armazene nossos dados em diferentes servidores de banco de dados.</p>\n<h3>1. Particionamento baseado em intervalo</h3>\n<p>Podemos armazene URLs em partições separadas como a primeira letra da chave de hash. Portanto, salvaremos todas as chaves de hash de URL começando com a letra ‘A’ (e ‘a’) em uma partição, salvaremos aquelas que começam com a letra ‘B’ em outra partição e assim por diante. Essa abordagem é chamada de particionamento baseado em intervalo. Podemos até combinar certas letras que ocorrem com menos frequência em uma partição de banco de dados. Assim, devemos desenvolver um esquema de particionamento estático para sempre armazenar/encontrar uma URL de maneira previsível.</p>\n<p>O principal problema com essa abordagem é que ela pode levar a servidores de banco de dados desbalanceados. Por exemplo, decidimos colocar todas as URLs que começam com a letra ‘E’ em uma partição de banco de dados, mas depois percebemos que temos muitas URLs que começam com a letra ‘E’.</p>\n<h3>2. Particionamento Baseado em Hash.</h3>\n<p>Neste esquema, pegamos um hash do objeto que estamos armazenando. Em seguida calculamos qual participação usar com base hash. No nosso caso, podemos pegar o hash da chave ou link curto para determinar a participação na qual armazenados o objeto de dados.</p>\n<p>Nossa função de hash distribuirá URLs aleatoriamente em diferentes partições(por exemplo, nossa função de hash pode sempre mapear qualquer ‘chave’ para um número entre [1,…,256]). Esse número representaria a partição na qual armazenamos nosso objeto.</p>\n<p>Essa abordagem ainda levar a partições sobrecarregadas, que pode ser resolvidas usando hash consistente.</p>\n<h3>Cache</h3>\n<p>Podemos armazenar em caches URLs acessados com frequência. Podemos usar qualquer solução de prateleira como o <a href=\"https://en.wikipedia.org/wiki/Memcached\">Memcached</a>, que pode armazenar URLs completos com seus respectivos hashes. Assim, os servidores de aplicativos, antes de atingir o armazenamento de back-end, podem verificar rapidamente se o cache possui a URL desejada.</p>\n<p><strong>Quanta memória cache devemos ter?</strong> Podemos começar com 20% do tráfego diário e, com ase nos padrões de uso dos clientes, podemos ajustar quantos servidores de cache precisamos. Conforme estimado acima, precisamos de 170-GB de memória para armazenar em 20% do tráfego diário. Como um servidor moderno pode ter 256gb de memória, podemos facilmente encaixar todo o cache em uma máquina. Como alternativa podemos usar alguns servidores para armazenar todas essas URLSs quentes.</p>\n<p><strong>Qual política de remoção de cache melhor atenderia às nossas necessidades?</strong> Quando o cache está cheio e queremos substituir um link por um URL mais recente/mais quente, como escolheríamos? Menos usado recentemente (LRU) pode ser uma política razoável para o nosso sistema. De acordo com essa política, descartamos primeiro o URL usado menos recentemente. Podemos usar um Linked Hash Map ou uma estrutura de dados semelhante para armazenar nossas URLs e Hashes, que também acompanharão as URLs que foram acessadas recentemente.</p>\n<p>Para aumentar a eficiência, podemos replicar nossos servidores de cache para distribuir a carga entre eles.</p>\n<p><strong>Como cada réplica de cache podemos ser atualizada?</strong> Sempre há uma falha de cache, nossos servidores atingem um banco de dados de back-end. Sempre que isso acontecer, podemos atualizar o cache e passar a nova entrada para todas as réplicas do cache. Cada réplica já tiver essa entrada, ela pode simplesmente ignorá-la.</p>\n<h3>Load Balance</h3>\n<p>Podemos adicionar uma camada de load balance em três locais em nosso sistema:</p>\n<ol>\n<li>Entre Cliente e servidores de aplicativos;</li>\n<li>Entre servidores de aplicativos e servidores de banco de dados;</li>\n<li>Entre servidores de aplicativos e servidores de cache.</li>\n</ol>\n<p>Inicialmente, poderíamos usar uma abordagem simples de Round Robin que distribui as solicitações recebidas igualmente entre os servidores de back-end. Este LB é simples de implementar e não apresenta nenhuma sobrecarga. Outro benefício dessa abordagem é que, se um servidor estiver inativo, o LB o retirará da rotação e interromperá o envio de tráfego para ele.</p>\n<p>Um problema com Round Robin LB é que não consideramos a carga do servidor. Como resultado, se um servidor estiver sobrecarregado ou lento, o LB não interrompera o envio de novas solicitações para esse servidor. Para lidar com isso. uma solução LB mais inteligente pode ser colocada que consulta periodicamente o servidor backend sobre sua carga e ajusta o tráfego com base nisso.</p>\n<h3>Limpeza de Banco de dados</h3>\n<p>As entradas devem permanecer para sempre ou devem ser eliminadas? Se um tempo de expiração especificado pelo usuário for atingido, o que deve acontecer com o link?</p>\n<p>Se escolhêssemos procurar continuamente por links expirados para removê-los, isso colocaria muita pressão em nosso banco de dados. Em vez disso, podemos remover lentamente os links expirados e fazer uma limpeza preguiçosa. Nosso serviço garantirá que apenas os links expirados sejam excluídos, embora alguns links expirados possam durar mais, mas nunca serão devolvidos aos usuários.</p>\n<ol>\n<li>Sempre que um usuário tentar acessar um link expirado, podemos excluir o link e retornar um erro ao usuário.</li>\n<li>Um serviço de limpeza separado pode ser executado periodicamente para remover links expirados de nosso armazenamento e cache. Esse serviço deve ser muito leve e programado para ser executado apenas quando o tráfego do usuário for baixo.</li>\n<li>Podemos ter um tempo de expiração padrão para cada link (por exemplo, dois anos). Após remover um link expirado, podemos colocar a chave de volta no key-DB para ser reutilizada.</li>\n<li>Devemos remover links que não são visitados há algum tempo, digamos, seis meses? Isso pode ser complicado. Como o armazenamento está ficando barato, podemos decidir manter os links para sempre.</li>\n</ol>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/833/1*Whiqok4SRHk8SCQJrPYOrg.png\"></figure><h3>Conclusão</h3>\n<p>Vimos como podemos criar um encurtador de URL de maneira que seja escalável e confiável. Mas algumas dessas ferramentas e tecnologias podem ser aplicado de acordo como o número de usuários crescem.</p>\n<p>Assim criei um encurtador de URL que pode ser aumentado conforme a aplicação cresce. E pode ser encontrado <a href=\"https://github.com/rafaelmgr12/mark-url\">aqui</a>.</p>\n<h3>Referencias</h3>\n<ul>\n<li><a href=\"https://www.educative.io/courses/grokking-the-system-design-interview/m2ygV4E81AR\">https://www.educative.io/courses/grokking-the-system-design-interview/m2ygV4E81AR</a></li>\n<li><a href=\"https://medium.com/double-pointer/system-design-interview-url-shortener-c45819b252cd\">https://medium.com/double-pointer/system-design-interview-url-shortener-c45819b252cd</a></li>\n<li><a href=\"https://towardsdatascience.com/system-design-of-url-shortening-service-b325b18c8f88\">https://towardsdatascience.com/system-design-of-url-shortening-service-b325b18c8f88</a></li>\n<li><a href=\"https://medium.com/@sandeep4.verma/system-design-scalable-url-shortener-service-like-tinyurl-106f30f23a82\">https://medium.com/@sandeep4.verma/system-design-scalable-url-shortener-service-like-tinyurl-106f30f23a82</a></li>\n<li><a href=\"https://github.com/Jeevan-kumar-Raj/Grokking-System-Design/blob/master/designs/short-url.md\">https://github.com/Jeevan-kumar-Raj/Grokking-System-Design/blob/master/designs/short-url.md</a></li>\n</ul>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=ec554470d649\" width=\"1\" height=\"1\" alt=\"\">\n","content":"\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/830/1*yY_xCZPB6pkwnMrvSAj1Nw.jpeg\"></figure><p>Olá, espero que estejam todos bem. Hoje falarei sobre como planejei e executei a criação de um encurtador de URL e também os próximos planos para que nosso sistema evolua de maneira saudável. Portanto, passaremos desde dos requisitos funcionais e não funcionas e também regra de negócios que nossa aplicação precisa cumprir.</p>\n<h3>O que é Encurtador de URL?</h3>\n<p>Antes de começar, é necessário explicar do que se trata esse tipo de serviço.</p>\n<p>O objetivo de um encurtador de url é bem simples. É um serviço bem conhecido, como, por exemplo, bit.ly ou tinyurl, que encurtar URL longos para URLs mais simples. Assim os usuários serão redirecionados para a URL original quando acessam esses links curtos. Por exemplo, pegue a seguinte URL:</p>\n<pre><a href=\"https://www.linkedin.com/in/rafael-mgr/\">https://www.linkedin.com/in/rafael-mgr/</a></pre>\n<p>Obteremos a seguinte link</p>\n<pre><a href=\"https://tinyurl.com/bdfwpx29\">https://tinyurl.com/bdfwpx29</a></pre>\n<p>Como pode ser visto, o link foi diminuiu drasticamente.</p>\n<p>O encurtamento de URL é usado para otimizar links entre dispositivos, rastrear links individuais para analisar o público, medir o desempenho de campanhas publicitárias ou ocultar URLs originais afiliados.</p>\n<h3>Requisitos funcionais e não funcionais.</h3>\n<p>Podemos seguir e definir quais são os requisitos funcionais e não funcionais e as regras de negócios. Mas antes disso, gostaria de definir o que são.</p>\n<h4>Requisitos Funcionais</h4>\n<p>São requisitos que devem ser atendidos e resolvidos pelo software por meio de funções ou serviços. Alguns exemplos desse tipo de requisitos:</p>\n<ul>\n<li>inserir dados em um formulário</li>\n<li>buscar pratos específicos em um cardápio;</li>\n<li>consultar a situação de um pedido;</li>\n<li>realizar compras;</li>\n<li>comunicar-se com um atendente;</li>\n<li>alterar informações de um registro;</li>\n<li>elaborar relatórios.</li>\n</ul>\n<p>Tudo o que for relacionada a uma ação a ser feita é considerado uma função. Também é importante lembrar que quanto menos ambíguos e mais objetivos forme os requisitos funcionais, maio será a qualidade do software gerado.</p>\n<h4>Requisitos não funcionais</h4>\n<p>Os requisitos não funcionais são todos aqueles relacionados à forma como o software tornará realidade os que está sendo planejado. Assim, enquanto requisitos funcionas estão focados no que será feito, os não funcionais descrevem como serão feitos.</p>\n<p>Dessa forma, todos os pré-requisitos do sistema, de hardware, de software e operacionais são documentados separadamente. Entre as características técnicas que podem ser definidas estão:</p>\n<ul>\n<li>tipo de sistema operacional;</li>\n<li>hardware a ser utilizado;</li>\n<li>processamento;</li>\n<li>consumo de memória;</li>\n<li>conexão;</li>\n<li>banco de dados;</li>\n<li>tipos de dispositivos onde o software pode ser usado.</li>\n</ul>\n<p>Além disso, os requisitos não funcionais podem ser categorizados em 3 tipos, requisitos de produto final, organizacional e externo. Contudo, também há outras categorias, como:</p>\n<ul>\n<li>de eficiência;</li>\n<li>de confiabilidade;</li>\n<li>de portabilidade;</li>\n<li>de entrega;</li>\n<li>de implementação;</li>\n<li>de padrões;</li>\n<li>de inter</li>\n</ul>\n<p>Podemos ir mais afundo nesses quesitos, porém foge um pouco do escopo desse artigo. Para saber mais, esse <a href=\"https://mestresdaweb.com.br/tecnologias/requisitos-funcionais-e-nao-funcionais-o-que-sao/#:~:text=O%20que%20s%C3%A3o%20requisitos%20n%C3%A3o,funcionais%20descrevem%20como%20ser%C3%A3o%20feitos.\">link</a> explica com maiores detalhes como podemos definir e separa os requisitos da nossa aplicação.</p>\n<p>Podemos agora retornar a definições de requisitos da nossa aplicação.</p>\n<p>Nesse primeiro momento, é preciso que seja definido os objetivos do nosso sistema, portanto nosso encurtador tem que atender os seguintes requisitos.</p>\n<p><strong>Requisitos Funcionais:</strong></p>\n<ol>\n<li>Dado um URL, nosso sistema tem que gerar um curto e único “alias” do nome. Esse link dever ser curto o suficiente para ser facilmente copiado e colocas entre aplicações.</li>\n<li>Quando usuários acessarem o link curto, nosso serviço deve redirecionar eles para o link original.</li>\n<li>Usuários devem ter a opção de pegar um link customizado para seu URL</li>\n<li>Os links devem expirar após um intervalo padrão. Os usuários deverem conseguir especificar o tempo de expiração.</li>\n</ol>\n<p><strong>Requisitos não Funcionais:</strong></p>\n<ol>\n<li>O sistema deve ter altamente disponível. Isso é necessário porque, se nosso serviço começar a falhar, os redirecionamentos de URL começarão a falhar.</li>\n<li>O redirecionamento de URL deve acontecer em tempo real com latência mínima.</li>\n<li>Links encurtados não devem ser adivinhados (não previsíveis)</li>\n</ol>\n<p><strong>Requisitos estendidos:</strong></p>\n<ol>\n<li>Análise; por exemplo, quantas vezes um redirecionamento aconteceu?</li>\n<li>Nosso serviço também deve ser acessível por meio de APIs REST por outros serviços.</li>\n</ol>\n<h3>Tráfico e Modelagem da Capacidade</h3>\n<p>Nosso sistema será usado, majoritariamente, em formato de leitura. Haverá mutias solicitações de redirecionamento em comparação com novos encurtamentos de URL. Suponhamos de início uma proporção 100:1 entre leitura e escrita.</p>\n<p><strong>Estimativa de tráfico:</strong> Assumindo, que teremos total de 500 milhões novas encurtamentos de URLs por mês, com proporção de leitura/gravação de 100:1, podemos esperar 50 bilhões de redirecionamentos durante o mesmo período:</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/179/1*LtejIPNTXj4g8_id34ohMA.gif\"></figure><p>Quantas queries por segundo seria feita para nosso sistema? Novos encurtamentos e URLs por segundo:</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/381/1*mJYO0lL1cIijkJuqIGgp7Q.gif\"></figure><p><strong>Estimativas de armazenamento</strong>: Assumiremos que armazenamos cada solicitação de encurtamento de URL (e link encurtado associado) por 5 anos. Como esperarmos ter 500 milhões de novos URLs armazenados todos os meses, o úmero total de objetos que esperarmos armazenar será de 30 bilhões:</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/272/1*89Tqrr9GWbmRK8zbOrvsvg.gif\"></figure><p>Vamos assumir que cada objeto armazenado será de aproximadamente 500 bytes(apenas uma estimativa aproximada — vamos investigar mais tarde). Precisaremos de 15 TB de armazenamento total.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/206/1*1fyIfpJ66yNuVRdho9b0EA.gif\"></figure><p><strong>Estimativas de largura de banda(Bandwidth estimates)</strong> : Para solicitações de gravação, como esperamos 200 novos urls a cada segundo, o total de dados de entrada para nosso serviço será de 100 KB por segundo</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/223/1*ErYRCCNcVJbO5HL9YWWotA.gif\"></figure><p>Para solicitações de leitura, como cada segundo esperamos redirecionamentos de cerca de 20 mil URLs, o total de dados de saída para nosso serviço seria de 10 MB por segundo:</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/221/1*WK-Xj0SKXiZqO19nFWl21w.gif\"></figure><p><strong>Estimativas de memória</strong>: Se quisermos armazenar em cache alguns das URLs quentes acessados com frequência, quanta memória precisaremos para armazená-los? Se seguirmos a regra 80–20, o que significa que 20% das URLs geram 80% do tráfego, gostaríamos de armazenar em cache esses 20% de URLs quentes.</p>\n<p>Como temos 20 mil solicitações por segundos, receberemos 1,7 bilhão de solicitações por dia:</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/319/1*ecC94OzRK0_KDkeMlneALg.gif\"></figure><p>Para armazenar em cache 20% dessas solicitações, precisaremos de 170 GB de memória.</p>\n<p><strong>Estimativas de alto nível</strong>: supondo 500 milhões de novos URLs por mês e proporção de leitura: gravação de 100:1, a seguir está o resumo das estimativas de alto nível para nosso serviço:</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/770/1*MKajaHkhGt1TeE3tokBvcg.png\"></figure><h3>Sistema de APIs</h3>\n<p>Podemos ter SOAP ou REST APIs para expor a funcionalidade do nosso serviço. A seguir, pode ser as definições das APIS para criar e excluir URLs:</p>\n<pre>createURL(api_dev_key, original_url, custom_alias=None, user_name=None, expire_date=None)</pre>\n<p><strong>Parâmetros:</strong></p>\n<ul>\n<li>api_dev_key (string): A chave de desenvolvedor da API de uma conta registrada. Isso será usado para, entre outras coisas, limitar os usuários com base em sua cota alocada.</li>\n<li>original_url (string): URL original a ser encurtado.</li>\n<li>custom_alias (string): chave personalizada opcional para a URL.</li>\n<li>user_name (string): nome de usuário opcional a ser usado na codificação.</li>\n<li>expire_date (string): data de expiração opcional para a URL abreviada</li>\n</ul>\n<p><strong>Retorno</strong>: (string)</p>\n<p>Uma inserção bem-sucedida retorna o URL abreviado; caso contrário, ele retornará um código de erro.</p>\n<pre>deleteURL(api_dev_key, url_key)</pre>\n<p>Onde “url_key” é uma string que representa a URL abreviada a ser recuperada; uma exclusão bem-sucedida retorna ‘URL removido’.</p>\n<p><strong>Como detectamos e prevenimos o abuso</strong>? Um usuário mal-intencionado pode nos tirar do negócio consumindo todas as chaves de URL no design atual. Para evitar abusos, podemos limitar os usuários por meio da api_dev_key. Cada api_dev_key pode ser limitada a um certo número de criações e redirecionamentos de URL por algum período (que pode ser definido para uma duração diferente por chave de desenvolvedor).</p>\n<h3>Design Database</h3>\n<p>Antes de começar, temos algumas observações sobre a natureza dos dados que armazenaremos:</p>\n<ol>\n<li>Precisaremos armazenar bilhões de registros.</li>\n<li>Cada Objeto que é pequeno (menos de 1K)</li>\n<li>Não há relacionamento entres registros., exceto armazena qual usuário criou um URL.</li>\n<li>Nosso serviço é pesado de Leitura</li>\n</ol>\n<h3>Esquema(Schema) do Database</h3>\n<p>É preciso de duas tabelas: uma para armazenar informações sobre os mapeamentos de URL e outra para os dados do usuário que criou link curto.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/463/0*DUlOWL9jCySbXFse.png\"></figure><p>Esquema de banco de dados de encurtamento de URL</p>\n<p>Que tipo de banco de dados devemos usar? Como antecipamos o armazenamento de bilhões de linhas e não precisamos usar relacionamentos entre objetos — um armazenamento NoSQL como DynamoDB, Cassandra ou Riak é uma escolha melhor. Uma escolha NoSQL também seria mais fácil de escalar. Consulte SQL vs NoSQL para obter mais detalhes.</p>\n<h3>Design Básico de Sistema e Algoritmo</h3>\n<p>O problema que estamos resolvendo é como gerar um curta e chave única para uma determinada URL.</p>\n<p>O exemplo dado para o caso TinyURL, a URL abreviada é “<a href=\"https://tinyurl.com/rxcsyr3r%E2%80%9D\">https://tinyurl.com/rxcsyr3r”</a>. Os últimos oito caracteres desta URL constituem a chave curta que queremos gerar. Exploremos duas soluções aqui:</p>\n<h3>1. Codificando a URL</h3>\n<p>Podemos calcular um hash exclusivo (por exemplo, um MD5 ou SHA256, etc ...) do URL fornecido. O hash pode então ser codificado para exibição. Essa codificação pode ser base36 ([a-z ,0–9]) ou base62 ([A-Z, a-z, 0–9]) e se adicionarmos ‘+’ e ‘/’ podemos usar a codificação Base64. Uma pergunta razoável seria: qual deve ser o comprimento da tecla curta? 6, 8 ou 10 caracteres?</p>\n<p>Usando a codificação base64, uma chave de 6 letras resultaria 68,7 bilhões de strings possíveis. Usando a codificação base64, uma chave de 8 letras resultaria em 281 trilhões de strings possíveis.</p>\n<p>Com 68,7 bilhões de strings únicas, suponhamos que seis letras seria suficiente para o nosso sistema.</p>\n<p>Se usarmos o algoritmo MD5 como nossa função de hash, ele produzirá um valor de hash de 128 bits. Após a codificação base64, obteremos uma string com mais de 21 caracteres (já que cada caracteres base64 codifica 6 bits do valor de hash). Agora só temos espaço para 6 (ou 8) caracteres por tecla curta, como vamos escolher nossa chave então? Podemos pegar as primeiras 6 (ou*) letras para a chave. Isso pode resultar em duplicação de chaves; para resolver isso, podemos escolher alguns outros caracteres da string de codificação ou trocar alguns caracteres.</p>\n<p>Quais são os diferentes problemas com a nossa solução? Temos os seguintes problemas como nosso esquema de codificação:</p>\n<ol>\n<li>Se vários usuários inserirem o mesmo URL, eles poderão obter o mesmo URL abreviado, o que não é aceitável.</li>\n<li>E se partes do URL forem codificadas por URL? por exemplo, <a href=\"http://www.educative.io/distributed.php?id=design\">http://www.educative.io/distributed.php?id=design</a> e <a href=\"http://www.educative.io/distributed.php%3Fid%3Ddesign\">http://www.educative.io/distributed.php%3Fid%3Ddesign</a> são idênticos, exceto pela codificação de URL.</li>\n</ol>\n<p><strong>Solução alternativa para os problemas</strong>: podemos anexar um número de sequências crescente a cada URL de entrada para torná-lo exclusivo e, em seguida, gerar seu hash. No entanto, não precisamos armazenar esse número de sequências nos bancos de dados Possíveis problemas com essa abordagem podem se um número de sequências crescentes. Pode transbordar? Acrescentar um número de sequência crescente também afetará o desempenho do serviço.</p>\n<p>Outra solução pode ser anexar o ID do usuário (que deve ser exclusivo) ao URL de entrada. No entanto, se o usuário não tiver feito login, teríamos que pedir ao usuário que escolhesse uma chave de exclusividade. Mesmo depois disso, se tivermos um conflito, teremos que continuar gerando uma chave até obtermos uma única.</p>\n<h3>2. Gerando Chaves offline</h3>\n<p>Podemos ter um <strong>Key Generation Service (KGS)</strong> autônomo que gera strings aleatórias de seis letras antecipadamente e as armazena em um banco de dados (vamos chamá-lo de key-db). Sempre que quisermos encurtar uma URL, pegaremos uma das chaves já geradas e a usaremos. Essa abordagem tornará as coais bastantes simples e rápidas. Não apenas não estamos codificando a URL, mas também não teremos que nos preocupar com duplicações ou colisões. KGS irá certificar-se de que todas as chaves inseridas no key-DB sejam únicas.</p>\n<p><strong>A concorrência pode causar problemas?</strong> Assim que uma chave for usada, ela deve ser marcada no banco de dados para garantir que não seja usada novamente. Se houver vários servidores lendo chaves simultaneamente, poderemos obter um cenário em que dois ou mais servidores tentem ler a mesma chave do banco de dados. Como podemos resolver esse problema de simultaneidade?</p>\n<p>Os servidores podem usar o KGS para ler/marcar chaves no banco de dados. KGS pode usar duas tabelas para armazenar chaves: uma para chaves que ainda não foram usadas e outra para todas as chaves usadas. Assim que o KGS entrega as chaves a um dos servidores, ele pode movê-las para a tabela de chaves usadas. O KGS sempre pode manter algumas chaves na memória para fornecê-las rapidamente sempre que um servidor precisar delas.</p>\n<p>Para simplificar, assim que o KGS carrega algumas chaves na memória, ele pode movê-las para a tabela de chaves usadas. Isso garante que cada servidor obtenha chaves exclusivas. Se o KGS morrer antes de atribuir todas as chaves carregadas a algum servidor, estaremos desperdiçando essas chaves — o que pode ser aceitável, dado o grande número de chaves que temos.</p>\n<p>O KGS também deve certificar-se de não fornecer a mesma chave para vários servidores. Para isso, ele deve sincronizar (ou bloquear) a estrutura de dados que contém as chaves antes de remover as chaves e entregá-las a um servidor.</p>\n<p><strong>Qual seria o tamanho do banco de dados de chave?</strong> Com a codificação base64, podemos gerar 68,7B chaves exclusivas de seis letras. Se precisarmos de um byte para armazenar um caractere alfanumérico, podemos armazenar todas essas chaves em:</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/705/1*C09XJHEWPQrG10mi6pQcqQ.png\"></figure><p><strong>A KGS não é um ponto único de falha?</strong> É sim para resolver isso, podemos ter réplica em espera do KGS. Sempre que o servidor primário morre, o servidor em esperar pode assumir o controle para gerar e fornecer chaves.</p>\n<p><strong>Cada servidor de aplicativos pode armazenar em cache algumas chaves do key-db?</strong> Sim, isso certamente pode acelerar as coisas. Embora neste caso, se o servidor de aplicativos morrer antes de consumir todas as chaves, acabaremos perdendo essas chaves. Isso pode ser aceitável, pois temos 68B teclas exclusivas de seis letras.</p>\n<p><strong>Como realizaríamos uma pesquisa de chave?</strong> Podemos procurar a chave em nosso banco de dados para obter o URL completo. Se estiver presente no banco de dados, emita um status “HTTP 302 Redirect” de volta ao navegador, passando a URL armazenada no campo “Location” da solicitação. Se essa chave não estiver presente em nosso sistema, emita um status “HTTP 404 Not Found” ou redirecione o usuário de volta para a página inicial.</p>\n<p><strong>Devemos impor limites de tamanho aos aliases personalizados?</strong> Nosso serviço oferece suporte a aliases personalizados. Os usuários podem escolher qualquer ‘chave’ que quiserem, mas fornecer um alias personalizado não é obrigatório. No entanto, é razoável (e muitas vezes desejável) impor um limite de tamanho em um alias personalizado para garantir que tenhamos um banco de dados de URL consistente. Suponhamos que os usuários especifiquem no máximo 16 caracteres por chave de cliente (conforme refletido no esquema de banco de dados acima).</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/767/1*skvMqInVYEsTAJtzu5-5Qw.png\"></figure><h3>Particionamento de Dados e Replicação</h3>\n<p>Para ser possível escalar o banco de dados, precisamos particioná-lo para poder armazenar informações sobre bilhões de URLs. Portanto, precisamos desenvolver um esquema de particionamento que divide e armazene nossos dados em diferentes servidores de banco de dados.</p>\n<h3>1. Particionamento baseado em intervalo</h3>\n<p>Podemos armazene URLs em partições separadas como a primeira letra da chave de hash. Portanto, salvaremos todas as chaves de hash de URL começando com a letra ‘A’ (e ‘a’) em uma partição, salvaremos aquelas que começam com a letra ‘B’ em outra partição e assim por diante. Essa abordagem é chamada de particionamento baseado em intervalo. Podemos até combinar certas letras que ocorrem com menos frequência em uma partição de banco de dados. Assim, devemos desenvolver um esquema de particionamento estático para sempre armazenar/encontrar uma URL de maneira previsível.</p>\n<p>O principal problema com essa abordagem é que ela pode levar a servidores de banco de dados desbalanceados. Por exemplo, decidimos colocar todas as URLs que começam com a letra ‘E’ em uma partição de banco de dados, mas depois percebemos que temos muitas URLs que começam com a letra ‘E’.</p>\n<h3>2. Particionamento Baseado em Hash.</h3>\n<p>Neste esquema, pegamos um hash do objeto que estamos armazenando. Em seguida calculamos qual participação usar com base hash. No nosso caso, podemos pegar o hash da chave ou link curto para determinar a participação na qual armazenados o objeto de dados.</p>\n<p>Nossa função de hash distribuirá URLs aleatoriamente em diferentes partições(por exemplo, nossa função de hash pode sempre mapear qualquer ‘chave’ para um número entre [1,…,256]). Esse número representaria a partição na qual armazenamos nosso objeto.</p>\n<p>Essa abordagem ainda levar a partições sobrecarregadas, que pode ser resolvidas usando hash consistente.</p>\n<h3>Cache</h3>\n<p>Podemos armazenar em caches URLs acessados com frequência. Podemos usar qualquer solução de prateleira como o <a href=\"https://en.wikipedia.org/wiki/Memcached\">Memcached</a>, que pode armazenar URLs completos com seus respectivos hashes. Assim, os servidores de aplicativos, antes de atingir o armazenamento de back-end, podem verificar rapidamente se o cache possui a URL desejada.</p>\n<p><strong>Quanta memória cache devemos ter?</strong> Podemos começar com 20% do tráfego diário e, com ase nos padrões de uso dos clientes, podemos ajustar quantos servidores de cache precisamos. Conforme estimado acima, precisamos de 170-GB de memória para armazenar em 20% do tráfego diário. Como um servidor moderno pode ter 256gb de memória, podemos facilmente encaixar todo o cache em uma máquina. Como alternativa podemos usar alguns servidores para armazenar todas essas URLSs quentes.</p>\n<p><strong>Qual política de remoção de cache melhor atenderia às nossas necessidades?</strong> Quando o cache está cheio e queremos substituir um link por um URL mais recente/mais quente, como escolheríamos? Menos usado recentemente (LRU) pode ser uma política razoável para o nosso sistema. De acordo com essa política, descartamos primeiro o URL usado menos recentemente. Podemos usar um Linked Hash Map ou uma estrutura de dados semelhante para armazenar nossas URLs e Hashes, que também acompanharão as URLs que foram acessadas recentemente.</p>\n<p>Para aumentar a eficiência, podemos replicar nossos servidores de cache para distribuir a carga entre eles.</p>\n<p><strong>Como cada réplica de cache podemos ser atualizada?</strong> Sempre há uma falha de cache, nossos servidores atingem um banco de dados de back-end. Sempre que isso acontecer, podemos atualizar o cache e passar a nova entrada para todas as réplicas do cache. Cada réplica já tiver essa entrada, ela pode simplesmente ignorá-la.</p>\n<h3>Load Balance</h3>\n<p>Podemos adicionar uma camada de load balance em três locais em nosso sistema:</p>\n<ol>\n<li>Entre Cliente e servidores de aplicativos;</li>\n<li>Entre servidores de aplicativos e servidores de banco de dados;</li>\n<li>Entre servidores de aplicativos e servidores de cache.</li>\n</ol>\n<p>Inicialmente, poderíamos usar uma abordagem simples de Round Robin que distribui as solicitações recebidas igualmente entre os servidores de back-end. Este LB é simples de implementar e não apresenta nenhuma sobrecarga. Outro benefício dessa abordagem é que, se um servidor estiver inativo, o LB o retirará da rotação e interromperá o envio de tráfego para ele.</p>\n<p>Um problema com Round Robin LB é que não consideramos a carga do servidor. Como resultado, se um servidor estiver sobrecarregado ou lento, o LB não interrompera o envio de novas solicitações para esse servidor. Para lidar com isso. uma solução LB mais inteligente pode ser colocada que consulta periodicamente o servidor backend sobre sua carga e ajusta o tráfego com base nisso.</p>\n<h3>Limpeza de Banco de dados</h3>\n<p>As entradas devem permanecer para sempre ou devem ser eliminadas? Se um tempo de expiração especificado pelo usuário for atingido, o que deve acontecer com o link?</p>\n<p>Se escolhêssemos procurar continuamente por links expirados para removê-los, isso colocaria muita pressão em nosso banco de dados. Em vez disso, podemos remover lentamente os links expirados e fazer uma limpeza preguiçosa. Nosso serviço garantirá que apenas os links expirados sejam excluídos, embora alguns links expirados possam durar mais, mas nunca serão devolvidos aos usuários.</p>\n<ol>\n<li>Sempre que um usuário tentar acessar um link expirado, podemos excluir o link e retornar um erro ao usuário.</li>\n<li>Um serviço de limpeza separado pode ser executado periodicamente para remover links expirados de nosso armazenamento e cache. Esse serviço deve ser muito leve e programado para ser executado apenas quando o tráfego do usuário for baixo.</li>\n<li>Podemos ter um tempo de expiração padrão para cada link (por exemplo, dois anos). Após remover um link expirado, podemos colocar a chave de volta no key-DB para ser reutilizada.</li>\n<li>Devemos remover links que não são visitados há algum tempo, digamos, seis meses? Isso pode ser complicado. Como o armazenamento está ficando barato, podemos decidir manter os links para sempre.</li>\n</ol>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/833/1*Whiqok4SRHk8SCQJrPYOrg.png\"></figure><h3>Conclusão</h3>\n<p>Vimos como podemos criar um encurtador de URL de maneira que seja escalável e confiável. Mas algumas dessas ferramentas e tecnologias podem ser aplicado de acordo como o número de usuários crescem.</p>\n<p>Assim criei um encurtador de URL que pode ser aumentado conforme a aplicação cresce. E pode ser encontrado <a href=\"https://github.com/rafaelmgr12/mark-url\">aqui</a>.</p>\n<h3>Referencias</h3>\n<ul>\n<li><a href=\"https://www.educative.io/courses/grokking-the-system-design-interview/m2ygV4E81AR\">https://www.educative.io/courses/grokking-the-system-design-interview/m2ygV4E81AR</a></li>\n<li><a href=\"https://medium.com/double-pointer/system-design-interview-url-shortener-c45819b252cd\">https://medium.com/double-pointer/system-design-interview-url-shortener-c45819b252cd</a></li>\n<li><a href=\"https://towardsdatascience.com/system-design-of-url-shortening-service-b325b18c8f88\">https://towardsdatascience.com/system-design-of-url-shortening-service-b325b18c8f88</a></li>\n<li><a href=\"https://medium.com/@sandeep4.verma/system-design-scalable-url-shortener-service-like-tinyurl-106f30f23a82\">https://medium.com/@sandeep4.verma/system-design-scalable-url-shortener-service-like-tinyurl-106f30f23a82</a></li>\n<li><a href=\"https://github.com/Jeevan-kumar-Raj/Grokking-System-Design/blob/master/designs/short-url.md\">https://github.com/Jeevan-kumar-Raj/Grokking-System-Design/blob/master/designs/short-url.md</a></li>\n</ul>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=ec554470d649\" width=\"1\" height=\"1\" alt=\"\">\n","enclosure":{},"categories":["software-development","system-design-concepts"]},{"title":"O Que é TCP/IP?","pubDate":"2023-01-23 12:26:43","link":"https://medium.com/@rgribeiro/o-que-%C3%A9-tcp-ip-bbd36bea7c0b?source=rss-303f8669abf9------2","guid":"https://medium.com/p/bbd36bea7c0b","author":"Rafael Ribeiro","thumbnail":"https://cdn-images-1.medium.com/max/1024/0*KqEHVB_VJX0_4c_e","description":"\n<h4>Um breve resumo sobre o que é o protocolo TCP/IP.</h4>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*KqEHVB_VJX0_4c_e\"><figcaption>Photo by <a href=\"https://unsplash.com/@jordanharrison?utm_source=medium&amp;utm_medium=referral\">Jordan Harrison</a> on <a href=\"https://unsplash.com/?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>Durante uma busca pela internet por algum de desafio, acabei me deparando com a seguinte proposta.</p>\n<h4>Criar um sistema de comunicação com o protocolo TCP.</h4>\n<p>Onde não é permitido e usar outro método de comunicação como HTTP ou WebSocket. E usar a linguagem de programação em Go para criar um servidor e cliente onde a comunicação será dado pelo protocolo TCP.</p>\n<p><strong>Requisitos</strong></p>\n<ul>\n<li>Criar um servidor TCP que escuta numa porta especificada por uma variável de ambiente PORT</li>\n<li>Criar um cliente TCP que se conecta a um servidor.</li>\n<li>Quando um cliente se conecta ao servidor, um id único é gerado e enviado de volta ao cliente.</li>\n<li>O cliente pode enviar mensagens com três dados:</li>\n<li>id — o id do cliente (obrigatório)</li>\n<li>action — uma ação esperada pelo servidor (obrigatório)</li>\n<li>body — qualquer dado (json, texto puro, tanto faz) que um cliente deseja envivar para o servidor (opcional)</li>\n<li>Quando o cliente envia uma mensagem com action LIST o servidor deve retornar uma lista de todos os ids de clientes conectados.</li>\n<li>Quando o cliente envia uma mensagem com action RELAY o servidor deve enviar a mensagem do campo body para todos os clientes conectados.</li>\n</ul>\n<p><strong>Assim fiquei me perguntando o que a final seria esse protocolo?</strong> Dessa forma, achei interessante fazer escrever um resumo sobre e tentar explicar como funcionário um código dessa forma para ser possível.</p>\n<p>O protocolo TCP/IP é um conjunto de regras e padrões que governam a comunicação de dados na Internet e em redes privadas baseadas em IP. Ele é composto por dois protocolos principais: o <strong>TCP (Transmission Control Protocol) e o IP (Internet Protocol).</strong></p>\n<p>O TCP é responsável por garantir que as informações sejam transmitidas de forma confiável e correta, enquanto o IP é responsável por garantir que as informações cheguem ao destino correto. Juntos, esses protocolos permitem que dispositivos em diferentes redes se comuniquem entre si.</p>\n<p><strong>TCP </strong>é um protocolo orientado a conexão, ou seja, antes de iniciar a comunicação entre dispositivos, é estabelecida uma conexão lógica sendo garantida a confiabilidade na transmissão, ele também é responsável por controlar o fluxo de dados, retransmitir pacotes perdidos e garantir a ordenação correta dos pacotes.</p>\n<p><strong>Já o IP é um protocolo orientado a pacote, ele é responsável por identificar e endereçar os dispositivos na rede, além de encaminhar os pacotes de dados ao destino correto.</strong></p>\n<p>Juntos, esses dois protocolos permitem que os dispositivos em uma rede se comuniquem entre si e que os dados viajem de forma confiável e precisa através da Internet e outras redes baseadas em IP.</p>\n<h4>Como funciona?</h4>\n<p>As conexões TCP funcionam através de um processo chamado de “handshake” de três etapas. O handshake de três etapas é um processo que estabelece uma conexão entre dois dispositivos em uma rede antes que qualquer dado seja trocado. O processo consiste em três etapas:</p>\n<ol>\n<li>O dispositivo iniciador, conhecido como cliente, envia um pacote com a bandeira SYN (sincronizar) para o dispositivo de destino, conhecido como servidor. Este pacote é chamado de pacote SYN e serve como uma solicitação para iniciar uma conexão.</li>\n<li>O servidor recebe o pacote SYN e responde com um pacote com as bandeiras SYN e ACK (confirmar) configuradas. Este pacote é chamado de pacote SYN-ACK e serve como uma confirmação da solicitação do cliente para iniciar uma conexão.</li>\n<li>O cliente recebe o pacote SYN-ACK e envia um pacote com apenas a bandeira ACK configurada. Este pacote é chamado de pacote ACK e serve como uma confirmação final do estabelecimento da conexão.</li>\n</ol>\n<p>Neste ponto, a conexão é estabelecida e os dados podem ser trocados entre o cliente e o servidor. Uma vez que a transferência de dados está completa, qualquer lado pode iniciar a finalização da conexão, o que é feito através de um processo semelhante de enviar pacotes com a bandeira FIN (finalizar). Este processo é chamado de “handshake” de quatro etapas sendo usado para fechar a conexão.</p>\n<h4>Código em GO</h4>\n<p>Para fazer esse teste de conceito eu crie um simples código em GO que pode se encontrado <a href=\"https://github.com/rafaelmgr12/simple-tcp-server\">aqui</a>.</p>\n<p>Neste projeto simples, foi desenvolvido um servidor que utiliza o protocolo TCP e fica escutando quando um cliente se conecta. Dessa forma, é possível se comunicar com o servidor, enviando e/ou recebendo dados.</p>\n<p>Além disso, devido à facilidade de lidar com concorrência na linguagem Go, este código consegue gerenciar eficazmente vários clientes conectados simultaneamente ao nosso servidor.</p>\n<h3><strong>De volta para o desafio</strong></h3>\n<p>Com esse tutorial feito podemos modificar para ser possível implementar os requisitos propostos pelo desafio.</p>\n<p>Eu dividi o trabalho em algumas partes, segue:</p>\n<ol>\n<li>Criar um servidor TCP que escuta na porta especificada por uma variável de ambiente PORT: Utilize a biblioteca net do Go para criar um servidor TCP que escuta na porta especificada.</li>\n<li>Criar um cliente TCP que se conecta a um servidor: Utilize a biblioteca net do Go para criar um cliente TCP que se conecta ao servidor.</li>\n<li>Gerar um id único para cada cliente que se conecta ao servidor: crie um método para gerar um id único para cada cliente que se conecta ao servidor. Envie este id de volta ao cliente quando ele se conectar.</li>\n<li>Implementar ações esperadas pelo servidor: Para as ações esperadas pelo servidor, como “LIST” e “RELAY”, implemente as lógicas necessárias para que o servidor possa processar essas ações.</li>\n<li>Enviar e receber dados entre cliente e servidor: utilize a biblioteca io do Go para enviar e receber dados entre o cliente e o servidor.</li>\n</ol>\n<p>O primeiro passo é simples: algumas modificações simples no tutorial são necessárias, especificamente definir uma variável de ambiente para a porta do servidor e fazer o mesmo para o cliente. Assim, o primeiro requisito está pronto.</p>\n<p>Agora, geraremos um ID único. Escolhi gerar a partir de um UUID e para isso usei a biblioteca do Google chamada UUID (o link das bibliotecas usadas está no meu repositório). Em seguida, basta enviar o ID para o cliente quando ele se conectar à aplicação.</p>\n<p>A configuração de envio e recebimento foi feita com as bibliotecas net e io, bibliotecas padrão do Go. Essa parte foi um pouco complicada; o código precisa ser melhorado para ser mais legível e limpo.</p>\n<p>Por último, implementamos os métodos “LIST” e “RELAY”. Para ambos, foi necessário usar a estrutura de dados de hashmap para mapear o ID e o endereço da conexão do cliente. Então, basta configurar alguns switch case para executar os métodos.</p>\n<p>Para ter algum método de autenticação, também implementei um método simples, onde o cliente precisa enviar o ID gerado pelo servidor de volta para ser possível acessar os métodos requisitados.</p>\n<p><strong>Conclusão</strong></p>\n<p>É a primeira vez que fiz uma implementação de um servidor/cliente usando o protocolo TCP. Portanto, tive que pesquisar e estudar sobre o que é e definir alguns pontos para começar. Como desenvolvi isso em apenas 3 dias e sem nunca ter visto esse tipo de protocolo, ainda não consegui chegar no padrão de qualidade de código que eu desejo. Há alguns problemas de design, mas a refatoração pode ser feita mais tarde. Esse desafio foi bem difícil, já que me tirou da minha zona de conforto, mas acho que foi legal aprender mais sobre redes e protocolos.</p>\n<p>O repositório do projeto está aqui:</p>\n<p><a href=\"https://github.com/rafaelmgr12/syscom-tcp\">GitHub - rafaelmgr12/syscom-tcp</a></p>\n<h3>Referências:</h3>\n<p><a href=\"https://www.golinuxcloud.com/golang-tcp-server-client/\">Golang TCP Server and Client Example [Tutorial] | GoLinuxCloud</a></p>\n<p><a href=\"http://www.inanzzz.com/index.php/post/j3n1/creating-a-concurrent-tcp-client-and-server-example-with-golang\">Creating a concurrent TCP client and server example with Golang</a></p>\n<p><a href=\"https://www.linode.com/docs/guides/developing-udp-and-tcp-clients-and-servers-in-go/\">Create a TCP and UDP Client and Server using Go</a></p>\n<p><a href=\"https://systembash.com/a-simple-go-tcp-server-and-tcp-client/\">A Simple Go TCP Server and TCP Client</a></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=bbd36bea7c0b\" width=\"1\" height=\"1\" alt=\"\">\n","content":"\n<h4>Um breve resumo sobre o que é o protocolo TCP/IP.</h4>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*KqEHVB_VJX0_4c_e\"><figcaption>Photo by <a href=\"https://unsplash.com/@jordanharrison?utm_source=medium&amp;utm_medium=referral\">Jordan Harrison</a> on <a href=\"https://unsplash.com/?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>Durante uma busca pela internet por algum de desafio, acabei me deparando com a seguinte proposta.</p>\n<h4>Criar um sistema de comunicação com o protocolo TCP.</h4>\n<p>Onde não é permitido e usar outro método de comunicação como HTTP ou WebSocket. E usar a linguagem de programação em Go para criar um servidor e cliente onde a comunicação será dado pelo protocolo TCP.</p>\n<p><strong>Requisitos</strong></p>\n<ul>\n<li>Criar um servidor TCP que escuta numa porta especificada por uma variável de ambiente PORT</li>\n<li>Criar um cliente TCP que se conecta a um servidor.</li>\n<li>Quando um cliente se conecta ao servidor, um id único é gerado e enviado de volta ao cliente.</li>\n<li>O cliente pode enviar mensagens com três dados:</li>\n<li>id — o id do cliente (obrigatório)</li>\n<li>action — uma ação esperada pelo servidor (obrigatório)</li>\n<li>body — qualquer dado (json, texto puro, tanto faz) que um cliente deseja envivar para o servidor (opcional)</li>\n<li>Quando o cliente envia uma mensagem com action LIST o servidor deve retornar uma lista de todos os ids de clientes conectados.</li>\n<li>Quando o cliente envia uma mensagem com action RELAY o servidor deve enviar a mensagem do campo body para todos os clientes conectados.</li>\n</ul>\n<p><strong>Assim fiquei me perguntando o que a final seria esse protocolo?</strong> Dessa forma, achei interessante fazer escrever um resumo sobre e tentar explicar como funcionário um código dessa forma para ser possível.</p>\n<p>O protocolo TCP/IP é um conjunto de regras e padrões que governam a comunicação de dados na Internet e em redes privadas baseadas em IP. Ele é composto por dois protocolos principais: o <strong>TCP (Transmission Control Protocol) e o IP (Internet Protocol).</strong></p>\n<p>O TCP é responsável por garantir que as informações sejam transmitidas de forma confiável e correta, enquanto o IP é responsável por garantir que as informações cheguem ao destino correto. Juntos, esses protocolos permitem que dispositivos em diferentes redes se comuniquem entre si.</p>\n<p><strong>TCP </strong>é um protocolo orientado a conexão, ou seja, antes de iniciar a comunicação entre dispositivos, é estabelecida uma conexão lógica sendo garantida a confiabilidade na transmissão, ele também é responsável por controlar o fluxo de dados, retransmitir pacotes perdidos e garantir a ordenação correta dos pacotes.</p>\n<p><strong>Já o IP é um protocolo orientado a pacote, ele é responsável por identificar e endereçar os dispositivos na rede, além de encaminhar os pacotes de dados ao destino correto.</strong></p>\n<p>Juntos, esses dois protocolos permitem que os dispositivos em uma rede se comuniquem entre si e que os dados viajem de forma confiável e precisa através da Internet e outras redes baseadas em IP.</p>\n<h4>Como funciona?</h4>\n<p>As conexões TCP funcionam através de um processo chamado de “handshake” de três etapas. O handshake de três etapas é um processo que estabelece uma conexão entre dois dispositivos em uma rede antes que qualquer dado seja trocado. O processo consiste em três etapas:</p>\n<ol>\n<li>O dispositivo iniciador, conhecido como cliente, envia um pacote com a bandeira SYN (sincronizar) para o dispositivo de destino, conhecido como servidor. Este pacote é chamado de pacote SYN e serve como uma solicitação para iniciar uma conexão.</li>\n<li>O servidor recebe o pacote SYN e responde com um pacote com as bandeiras SYN e ACK (confirmar) configuradas. Este pacote é chamado de pacote SYN-ACK e serve como uma confirmação da solicitação do cliente para iniciar uma conexão.</li>\n<li>O cliente recebe o pacote SYN-ACK e envia um pacote com apenas a bandeira ACK configurada. Este pacote é chamado de pacote ACK e serve como uma confirmação final do estabelecimento da conexão.</li>\n</ol>\n<p>Neste ponto, a conexão é estabelecida e os dados podem ser trocados entre o cliente e o servidor. Uma vez que a transferência de dados está completa, qualquer lado pode iniciar a finalização da conexão, o que é feito através de um processo semelhante de enviar pacotes com a bandeira FIN (finalizar). Este processo é chamado de “handshake” de quatro etapas sendo usado para fechar a conexão.</p>\n<h4>Código em GO</h4>\n<p>Para fazer esse teste de conceito eu crie um simples código em GO que pode se encontrado <a href=\"https://github.com/rafaelmgr12/simple-tcp-server\">aqui</a>.</p>\n<p>Neste projeto simples, foi desenvolvido um servidor que utiliza o protocolo TCP e fica escutando quando um cliente se conecta. Dessa forma, é possível se comunicar com o servidor, enviando e/ou recebendo dados.</p>\n<p>Além disso, devido à facilidade de lidar com concorrência na linguagem Go, este código consegue gerenciar eficazmente vários clientes conectados simultaneamente ao nosso servidor.</p>\n<h3><strong>De volta para o desafio</strong></h3>\n<p>Com esse tutorial feito podemos modificar para ser possível implementar os requisitos propostos pelo desafio.</p>\n<p>Eu dividi o trabalho em algumas partes, segue:</p>\n<ol>\n<li>Criar um servidor TCP que escuta na porta especificada por uma variável de ambiente PORT: Utilize a biblioteca net do Go para criar um servidor TCP que escuta na porta especificada.</li>\n<li>Criar um cliente TCP que se conecta a um servidor: Utilize a biblioteca net do Go para criar um cliente TCP que se conecta ao servidor.</li>\n<li>Gerar um id único para cada cliente que se conecta ao servidor: crie um método para gerar um id único para cada cliente que se conecta ao servidor. Envie este id de volta ao cliente quando ele se conectar.</li>\n<li>Implementar ações esperadas pelo servidor: Para as ações esperadas pelo servidor, como “LIST” e “RELAY”, implemente as lógicas necessárias para que o servidor possa processar essas ações.</li>\n<li>Enviar e receber dados entre cliente e servidor: utilize a biblioteca io do Go para enviar e receber dados entre o cliente e o servidor.</li>\n</ol>\n<p>O primeiro passo é simples: algumas modificações simples no tutorial são necessárias, especificamente definir uma variável de ambiente para a porta do servidor e fazer o mesmo para o cliente. Assim, o primeiro requisito está pronto.</p>\n<p>Agora, geraremos um ID único. Escolhi gerar a partir de um UUID e para isso usei a biblioteca do Google chamada UUID (o link das bibliotecas usadas está no meu repositório). Em seguida, basta enviar o ID para o cliente quando ele se conectar à aplicação.</p>\n<p>A configuração de envio e recebimento foi feita com as bibliotecas net e io, bibliotecas padrão do Go. Essa parte foi um pouco complicada; o código precisa ser melhorado para ser mais legível e limpo.</p>\n<p>Por último, implementamos os métodos “LIST” e “RELAY”. Para ambos, foi necessário usar a estrutura de dados de hashmap para mapear o ID e o endereço da conexão do cliente. Então, basta configurar alguns switch case para executar os métodos.</p>\n<p>Para ter algum método de autenticação, também implementei um método simples, onde o cliente precisa enviar o ID gerado pelo servidor de volta para ser possível acessar os métodos requisitados.</p>\n<p><strong>Conclusão</strong></p>\n<p>É a primeira vez que fiz uma implementação de um servidor/cliente usando o protocolo TCP. Portanto, tive que pesquisar e estudar sobre o que é e definir alguns pontos para começar. Como desenvolvi isso em apenas 3 dias e sem nunca ter visto esse tipo de protocolo, ainda não consegui chegar no padrão de qualidade de código que eu desejo. Há alguns problemas de design, mas a refatoração pode ser feita mais tarde. Esse desafio foi bem difícil, já que me tirou da minha zona de conforto, mas acho que foi legal aprender mais sobre redes e protocolos.</p>\n<p>O repositório do projeto está aqui:</p>\n<p><a href=\"https://github.com/rafaelmgr12/syscom-tcp\">GitHub - rafaelmgr12/syscom-tcp</a></p>\n<h3>Referências:</h3>\n<p><a href=\"https://www.golinuxcloud.com/golang-tcp-server-client/\">Golang TCP Server and Client Example [Tutorial] | GoLinuxCloud</a></p>\n<p><a href=\"http://www.inanzzz.com/index.php/post/j3n1/creating-a-concurrent-tcp-client-and-server-example-with-golang\">Creating a concurrent TCP client and server example with Golang</a></p>\n<p><a href=\"https://www.linode.com/docs/guides/developing-udp-and-tcp-clients-and-servers-in-go/\">Create a TCP and UDP Client and Server using Go</a></p>\n<p><a href=\"https://systembash.com/a-simple-go-tcp-server-and-tcp-client/\">A Simple Go TCP Server and TCP Client</a></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=bbd36bea7c0b\" width=\"1\" height=\"1\" alt=\"\">\n","enclosure":{},"categories":["go","tcp"]},{"title":"Como encontrar elementos duplicados em uma Lista?","pubDate":"2022-07-12 11:12:44","link":"https://medium.com/@rgribeiro/como-achar-elementos-duplicados-em-uma-lista-69ead8889a2f?source=rss-303f8669abf9------2","guid":"https://medium.com/p/69ead8889a2f","author":"Rafael Ribeiro","thumbnail":"https://cdn-images-1.medium.com/max/1024/1*GlBRiPadpVQv9xqoLMfU1A.png","description":"\n<p>Lógica é requisito para todo programador, e para continuar me aperfeiçoando, uso algumas plataformas online como a HackerRank e LeetCode. E essas plataformas têm desafios de programação para todos os níveis. Dessa forma é possível treinar lógica como também estrutura de dados como ferramentas para resolução do mesmo.</p>\n<h3>Problema</h3>\n<p>Dito isso, durante um exercício achei que seria relevante compartilhar. Num primeiro momento ele parece bem simples. O enunciado é o seguinte.</p>\n<blockquote><em>Dado um vetor de inteiros, nums, contendo n+1 inteiros onde cada inteiro está no intervalo [1,n] . Existe apenas um número repetido em nums, retorne esse número repetido</em></blockquote>\n<p>As restrições são</p>\n<ul>\n<li>1≤ n≤10⁵</li>\n<li>nums.length == n + 1</li>\n<li>1 &lt;= nums[i] &lt;= n</li>\n<li>Todos os inteiros em nums aparecem apenas uma vez, exceto precisamente um inteiro que aparece duas ou mais vezes.</li>\n</ul>\n<p>A obrigatoriedade de conter um inteiro repetido vem do<strong> Pigeonhole principle</strong>. É um princípio bem conhecido na matemática, vocês podem consultar isso facilmente na internet. É recomendável olhar a prova, é bem interessante como faz alusão à vários problemas reais.</p>\n<p>Bem, o que dificulta o problema é restrição na solução que é:</p>\n<blockquote><em>Você deve resolver o problema sem modificar o vetor nums e usa apenas espaço extra constante.</em></blockquote>\n<p>Como pode ser visto essa restrição torna o problema difícil, tendo em vista que não é possível usar nenhum estrutura de dados e também não é possível modificar o vetor nums.</p>\n<h3>Solução</h3>\n<p>Esse é um problema clássico, com duas soluções possíveis. A primeira que usarei, estarei ignorando a restrição de modificação do problema. Essa forma é apenas um começo para gente pensar em como resolver esse problema.</p>\n<p>Bem, para começar usarei uma abordagem bem simples, mas que resolveria esse problema se não houvesse restrição na solução.</p>\n<p>A ideia é a seguinte, a primeiro momento nosso vetor tem valores espalhados e não segue uma ordem específica. Mas e se fizessemos a ordenação desse vetor? Os valores duplicados estariam perto um do outro.</p>\n<p>Temos que:</p>\n<ol>\n<li>Ordenar o vetor nums;</li>\n<li>Executar um loop para examinar os elementos e se o elemento subsequente for igual ao antecessor temos o valor duplicado;</li>\n<li>Retorna o primeiro número que é igual ao seu antecessor.</li>\n</ol>\n<p>O código em python fica da seguinte forma:</p>\n<pre>def findDuplicate(nums):<br>        nums.sort()<br>        for i in range(1, len(nums)):<br>            if nums[i] == nums[i-1]:<br>                return nums[i]</pre>\n<p>Essa solução já seria suficiente, pois se analisarmos a Complexidade teríamos o seguinte:</p>\n<ul><li>\n<strong>Complexidade de tempo :</strong> O(n log n)</li></ul>\n<p>Ordenação leva O(n log n). E seguindo fazer uma loop linear para avaliar os elementos do vetor assim resultando, O(n log n) + O(n) = O(n log n)</p>\n<ul><li>\n<strong>Complexidade no espaço</strong>: <em>O(logn)</em> or <em>O(n)</em>\n</li></ul>\n<p>A complexidade do espaço do algoritmo de ordenação depende da implementação de cada linguagem de programação:</p>\n<ul>\n<li>Java, Arrays.sort() é implementado usando uma variante do algoritmo Quick Sort, que tem uma complexidade de espaço de O(log n)</li>\n<li>Em C++, a função sort() fornecida pelo STL usa um híbrido de Quick Sort, Heap Sort e Insertion Sort, com uma complexidade de espaço no pior caso de O(log n)</li>\n<li>Em Python, a função sort() é implementada usando o algoritmo Timsort, que tem uma complexidade de espaço de pior caso de O(n)</li>\n</ul>\n<p>A restrição no espaço também se tonar um problema, já que poderíamos usar um HashMap para contar valores os valores e armazená-los. Assim temos que pensar um pouco mais para assim conseguir pensar numa solução que siga essa restrição.</p>\n<h3>Detecção Cíclica</h3>\n<p>Podemos usar um algoritmo de detecção cíclica. A ideá é pensar que esse vetor possar ser tratado como uma lista encadeada e como temos um valor repetido esse valor fará a lista conter um ciclo. Pode ser observado na figura abaixo a ideia.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*GlBRiPadpVQv9xqoLMfU1A.png\"></figure><p>Como pode ser visto o valor duplicado em nosso vetor se tornar a entrada em nosso ciclo. A ideia é reduzir esse problema a <a href=\"https://www.hackerrank.com/challenges/detect-whether-a-linked-list-contains-a-cycle/problem\">Cycle Detection</a> ou <a href=\"https://leetcode.com/problems/linked-list-cycle-ii/solution/\">Linked List Cycle II</a>.</p>\n<p>Podemos aumentar o tamanho do vetor nums para ilustrar melhor nosso problema.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*oxz5lWqerwMRdDqIcSi36Q.png\"></figure><h3>Floyd’s Hare and Tortoise</h3>\n<p>É um algoritmo de ponteiro que usa apenas dois ponteiros, que se movem pela sequência em velocidades diferentes. Também é chamado de “algoritmo da tartaruga e da lebre”, aludindo à fábula de Esopo, A tartaruga e a lebre.</p>\n<p>Para entender de maneira clara dividiremos o procedimento em duas partes. Assim, trazendo ela para o nosso problema tem o seguinte.</p>\n<p><strong>Primeira Fase:</strong></p>\n<p>hare = nums[nums[hare]] é duas vezes mais rápido que tortoise = nums[tortoise]. Como a lebre anda rápido, seria a primeira a entrar no ciclo e correr ao redor do ciclo. Em algum momento, a tartaruga também entra no ciclo e, como está se movendo mais devagar, a lebre alcança a tartaruga em algum ponto de interseção. Agora a fase 1 acabou e a tartaruga perdeu.</p>\n<blockquote><em>Observe que o ponto de interseção não é a entrada do ciclo no caso geral.</em></blockquote>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*OYJE40t-qH22Of2_.png\"></figure><p>É possível calcular a interseção, basta notar que a lebre(hare) percorreu o dobro da tartaruga(tortoise), ou seja, 2d(tortoise) = d(hare):</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/211/0*tWsxGp0z0MuS8gM1\"></figure><p>Onde n é um número inteiro. É importante notar que esse passo é crucial e prova que algoritmo de Floyd funciona. Visto que estamos calculando a distância do primeiro elemento da lista até o ponto da interseção, essa conta se tonar algo indispensável para implementar a próxima fase do algoritmo.</p>\n<p><strong>Segunda Fase:</strong></p>\n<p>Nessa fase daremos a tartaruga uma segunda chance, ou seja, diminuiremos a velocidade da lebre, de modo que agora ela se mova na velocidade da tartaruga: tortoise = nums[tortoise] ,hare = nums[hare]. A tartaruga está de volta à posição inicial e a lebre parte do ponto de interseção.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*p2uHTOH37bK6ma7QKYdw9w.png\"></figure><p>Mostraremos que desta vez eles se encontram na entrada do ciclo após F passos.</p>\n<ul>\n<li>A tartaruga começou em zero, então sua posição após o F passos é F.</li>\n<li>A lebre começou no ponto de interseção F + a = nC, então sua posição após F passos é nC+F, o mesmo ponto que F.</li>\n<li>Assim, a tartaruga e a lebre (desacelerada) se encontrarão na entrada do ciclo.</li>\n</ul>\n<p>A imagem abaixo mostra o que acontece durante todas as fases.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/500/1*09n9E-RUgjCd6uIRzue7Gg.gif\"></figure><p>O código em python é escrito da seguinte forma:</p>\n<pre>def findDuplicate(nums):<br>        # Ache o ponto de interseção dos ponteiros<br>        tortoise = hare = nums[0]<br>        while True:<br>            tortoise = nums[tortoise]<br>            hare = nums[nums[hare]]<br>            if tortoise == hare:<br>                break<br><br>        # Ache o a entrada dentro do ciclo.<br>        tortoise = nums[0]<br>        while tortoise != hare:<br>            tortoise = nums[tortoise]<br>            hare = nums[hare]<br><br>        return hare</pre>\n<ul>\n<li>\n<strong>Complexidade de tempo:</strong> O(n)</li>\n<li>\n<strong>Complexidade no espaço</strong>: <em>O(1)</em>\n</li>\n</ul>\n<p>Aplicando esse método temos uma solução bem elegante e otimizada do nosso problema. Essa categoria de problema é aquela que se torna trivial quando se resolve, mas num primeiro momento não é intuitivo reduzi-lo em um problema de listas encadeada cíclicas.</p>\n<p>Se houver dúvida ainda, é possível printar no console os valores dos ponteiros tortoise e hare, para melhorar a visualização.</p>\n<h3>Referencias</h3>\n<ul>\n<li>Explicação em video pode ser vista <a href=\"https://www.youtube.com/watch?v=wjYnzkAhcNk\">aqui</a>.</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Cycle_detection\">Wikipedia</a></li>\n<li>Problema pode se encontrado <a href=\"https://leetcode.com/problems/find-the-duplicate-number/\">aqui</a>.</li>\n</ul>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=69ead8889a2f\" width=\"1\" height=\"1\" alt=\"\">\n","content":"\n<p>Lógica é requisito para todo programador, e para continuar me aperfeiçoando, uso algumas plataformas online como a HackerRank e LeetCode. E essas plataformas têm desafios de programação para todos os níveis. Dessa forma é possível treinar lógica como também estrutura de dados como ferramentas para resolução do mesmo.</p>\n<h3>Problema</h3>\n<p>Dito isso, durante um exercício achei que seria relevante compartilhar. Num primeiro momento ele parece bem simples. O enunciado é o seguinte.</p>\n<blockquote><em>Dado um vetor de inteiros, nums, contendo n+1 inteiros onde cada inteiro está no intervalo [1,n] . Existe apenas um número repetido em nums, retorne esse número repetido</em></blockquote>\n<p>As restrições são</p>\n<ul>\n<li>1≤ n≤10⁵</li>\n<li>nums.length == n + 1</li>\n<li>1 &lt;= nums[i] &lt;= n</li>\n<li>Todos os inteiros em nums aparecem apenas uma vez, exceto precisamente um inteiro que aparece duas ou mais vezes.</li>\n</ul>\n<p>A obrigatoriedade de conter um inteiro repetido vem do<strong> Pigeonhole principle</strong>. É um princípio bem conhecido na matemática, vocês podem consultar isso facilmente na internet. É recomendável olhar a prova, é bem interessante como faz alusão à vários problemas reais.</p>\n<p>Bem, o que dificulta o problema é restrição na solução que é:</p>\n<blockquote><em>Você deve resolver o problema sem modificar o vetor nums e usa apenas espaço extra constante.</em></blockquote>\n<p>Como pode ser visto essa restrição torna o problema difícil, tendo em vista que não é possível usar nenhum estrutura de dados e também não é possível modificar o vetor nums.</p>\n<h3>Solução</h3>\n<p>Esse é um problema clássico, com duas soluções possíveis. A primeira que usarei, estarei ignorando a restrição de modificação do problema. Essa forma é apenas um começo para gente pensar em como resolver esse problema.</p>\n<p>Bem, para começar usarei uma abordagem bem simples, mas que resolveria esse problema se não houvesse restrição na solução.</p>\n<p>A ideia é a seguinte, a primeiro momento nosso vetor tem valores espalhados e não segue uma ordem específica. Mas e se fizessemos a ordenação desse vetor? Os valores duplicados estariam perto um do outro.</p>\n<p>Temos que:</p>\n<ol>\n<li>Ordenar o vetor nums;</li>\n<li>Executar um loop para examinar os elementos e se o elemento subsequente for igual ao antecessor temos o valor duplicado;</li>\n<li>Retorna o primeiro número que é igual ao seu antecessor.</li>\n</ol>\n<p>O código em python fica da seguinte forma:</p>\n<pre>def findDuplicate(nums):<br>        nums.sort()<br>        for i in range(1, len(nums)):<br>            if nums[i] == nums[i-1]:<br>                return nums[i]</pre>\n<p>Essa solução já seria suficiente, pois se analisarmos a Complexidade teríamos o seguinte:</p>\n<ul><li>\n<strong>Complexidade de tempo :</strong> O(n log n)</li></ul>\n<p>Ordenação leva O(n log n). E seguindo fazer uma loop linear para avaliar os elementos do vetor assim resultando, O(n log n) + O(n) = O(n log n)</p>\n<ul><li>\n<strong>Complexidade no espaço</strong>: <em>O(logn)</em> or <em>O(n)</em>\n</li></ul>\n<p>A complexidade do espaço do algoritmo de ordenação depende da implementação de cada linguagem de programação:</p>\n<ul>\n<li>Java, Arrays.sort() é implementado usando uma variante do algoritmo Quick Sort, que tem uma complexidade de espaço de O(log n)</li>\n<li>Em C++, a função sort() fornecida pelo STL usa um híbrido de Quick Sort, Heap Sort e Insertion Sort, com uma complexidade de espaço no pior caso de O(log n)</li>\n<li>Em Python, a função sort() é implementada usando o algoritmo Timsort, que tem uma complexidade de espaço de pior caso de O(n)</li>\n</ul>\n<p>A restrição no espaço também se tonar um problema, já que poderíamos usar um HashMap para contar valores os valores e armazená-los. Assim temos que pensar um pouco mais para assim conseguir pensar numa solução que siga essa restrição.</p>\n<h3>Detecção Cíclica</h3>\n<p>Podemos usar um algoritmo de detecção cíclica. A ideá é pensar que esse vetor possar ser tratado como uma lista encadeada e como temos um valor repetido esse valor fará a lista conter um ciclo. Pode ser observado na figura abaixo a ideia.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*GlBRiPadpVQv9xqoLMfU1A.png\"></figure><p>Como pode ser visto o valor duplicado em nosso vetor se tornar a entrada em nosso ciclo. A ideia é reduzir esse problema a <a href=\"https://www.hackerrank.com/challenges/detect-whether-a-linked-list-contains-a-cycle/problem\">Cycle Detection</a> ou <a href=\"https://leetcode.com/problems/linked-list-cycle-ii/solution/\">Linked List Cycle II</a>.</p>\n<p>Podemos aumentar o tamanho do vetor nums para ilustrar melhor nosso problema.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*oxz5lWqerwMRdDqIcSi36Q.png\"></figure><h3>Floyd’s Hare and Tortoise</h3>\n<p>É um algoritmo de ponteiro que usa apenas dois ponteiros, que se movem pela sequência em velocidades diferentes. Também é chamado de “algoritmo da tartaruga e da lebre”, aludindo à fábula de Esopo, A tartaruga e a lebre.</p>\n<p>Para entender de maneira clara dividiremos o procedimento em duas partes. Assim, trazendo ela para o nosso problema tem o seguinte.</p>\n<p><strong>Primeira Fase:</strong></p>\n<p>hare = nums[nums[hare]] é duas vezes mais rápido que tortoise = nums[tortoise]. Como a lebre anda rápido, seria a primeira a entrar no ciclo e correr ao redor do ciclo. Em algum momento, a tartaruga também entra no ciclo e, como está se movendo mais devagar, a lebre alcança a tartaruga em algum ponto de interseção. Agora a fase 1 acabou e a tartaruga perdeu.</p>\n<blockquote><em>Observe que o ponto de interseção não é a entrada do ciclo no caso geral.</em></blockquote>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*OYJE40t-qH22Of2_.png\"></figure><p>É possível calcular a interseção, basta notar que a lebre(hare) percorreu o dobro da tartaruga(tortoise), ou seja, 2d(tortoise) = d(hare):</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/211/0*tWsxGp0z0MuS8gM1\"></figure><p>Onde n é um número inteiro. É importante notar que esse passo é crucial e prova que algoritmo de Floyd funciona. Visto que estamos calculando a distância do primeiro elemento da lista até o ponto da interseção, essa conta se tonar algo indispensável para implementar a próxima fase do algoritmo.</p>\n<p><strong>Segunda Fase:</strong></p>\n<p>Nessa fase daremos a tartaruga uma segunda chance, ou seja, diminuiremos a velocidade da lebre, de modo que agora ela se mova na velocidade da tartaruga: tortoise = nums[tortoise] ,hare = nums[hare]. A tartaruga está de volta à posição inicial e a lebre parte do ponto de interseção.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*p2uHTOH37bK6ma7QKYdw9w.png\"></figure><p>Mostraremos que desta vez eles se encontram na entrada do ciclo após F passos.</p>\n<ul>\n<li>A tartaruga começou em zero, então sua posição após o F passos é F.</li>\n<li>A lebre começou no ponto de interseção F + a = nC, então sua posição após F passos é nC+F, o mesmo ponto que F.</li>\n<li>Assim, a tartaruga e a lebre (desacelerada) se encontrarão na entrada do ciclo.</li>\n</ul>\n<p>A imagem abaixo mostra o que acontece durante todas as fases.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/500/1*09n9E-RUgjCd6uIRzue7Gg.gif\"></figure><p>O código em python é escrito da seguinte forma:</p>\n<pre>def findDuplicate(nums):<br>        # Ache o ponto de interseção dos ponteiros<br>        tortoise = hare = nums[0]<br>        while True:<br>            tortoise = nums[tortoise]<br>            hare = nums[nums[hare]]<br>            if tortoise == hare:<br>                break<br><br>        # Ache o a entrada dentro do ciclo.<br>        tortoise = nums[0]<br>        while tortoise != hare:<br>            tortoise = nums[tortoise]<br>            hare = nums[hare]<br><br>        return hare</pre>\n<ul>\n<li>\n<strong>Complexidade de tempo:</strong> O(n)</li>\n<li>\n<strong>Complexidade no espaço</strong>: <em>O(1)</em>\n</li>\n</ul>\n<p>Aplicando esse método temos uma solução bem elegante e otimizada do nosso problema. Essa categoria de problema é aquela que se torna trivial quando se resolve, mas num primeiro momento não é intuitivo reduzi-lo em um problema de listas encadeada cíclicas.</p>\n<p>Se houver dúvida ainda, é possível printar no console os valores dos ponteiros tortoise e hare, para melhorar a visualização.</p>\n<h3>Referencias</h3>\n<ul>\n<li>Explicação em video pode ser vista <a href=\"https://www.youtube.com/watch?v=wjYnzkAhcNk\">aqui</a>.</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Cycle_detection\">Wikipedia</a></li>\n<li>Problema pode se encontrado <a href=\"https://leetcode.com/problems/find-the-duplicate-number/\">aqui</a>.</li>\n</ul>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=69ead8889a2f\" width=\"1\" height=\"1\" alt=\"\">\n","enclosure":{},"categories":["leetcode","algorithms"]}]}